virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27_DFP/component/isc.h
#define ISC_PFE_CFG0_CCIR_Pos                 _U_(9)                                               /**< (ISC_PFE_CFG0 Position) CCIR656 input mode */
#define ISC_PFE_CFG0_CCIR_Msk                 (_U_(0x1) << ISC_PFE_CFG0_CCIR_Pos)                  /**< (ISC_PFE_CFG0 Mask) CCIR */
#define ISC_PFE_CFG0_CCIR(value)              (ISC_PFE_CFG0_CCIR_Msk & ((value) << ISC_PFE_CFG0_CCIR_Pos)) 

/* -------- ISC_PFE_CFG1 : (ISC Offset: 0x10) (R/W 32) Parallel Front End Configuration 1 Register -------- */
#define ISC_PFE_CFG1_COLMIN_Pos               _U_(0)                                               /**< (ISC_PFE_CFG1) Column Minimum Limit Position */
#define ISC_PFE_CFG1_COLMIN_Msk               (_U_(0xFFFF) << ISC_PFE_CFG1_COLMIN_Pos)             /**< (ISC_PFE_CFG1) Column Minimum Limit Mask */
#define ISC_PFE_CFG1_COLMIN(value)            (ISC_PFE_CFG1_COLMIN_Msk & ((value) << ISC_PFE_CFG1_COLMIN_Pos))
#define ISC_PFE_CFG1_COLMAX_Pos               _U_(16)                                              /**< (ISC_PFE_CFG1) Column Maximum Limit Position */
#define ISC_PFE_CFG1_COLMAX_Msk               (_U_(0xFFFF) << ISC_PFE_CFG1_COLMAX_Pos)             /**< (ISC_PFE_CFG1) Column Maximum Limit Mask */
#define ISC_PFE_CFG1_COLMAX(value)            (ISC_PFE_CFG1_COLMAX_Msk & ((value) << ISC_PFE_CFG1_COLMAX_Pos))
#define ISC_PFE_CFG1_Msk                      _U_(0xFFFFFFFF)                                      /**< (ISC_PFE_CFG1) Register Mask  */


/* -------- ISC_PFE_CFG2 : (ISC Offset: 0x14) (R/W 32) Parallel Front End Configuration 2 Register -------- */
#define ISC_PFE_CFG2_ROWMIN_Pos               _U_(0)                                               /**< (ISC_PFE_CFG2) Row Minimum Limit Position */
#define ISC_PFE_CFG2_ROWMIN_Msk               (_U_(0xFFFF) << ISC_PFE_CFG2_ROWMIN_Pos)             /**< (ISC_PFE_CFG2) Row Minimum Limit Mask */
#define ISC_PFE_CFG2_ROWMIN(value)            (ISC_PFE_CFG2_ROWMIN_Msk & ((value) << ISC_PFE_CFG2_ROWMIN_Pos))
#define ISC_PFE_CFG2_ROWMAX_Pos               _U_(16)                                              /**< (ISC_PFE_CFG2) Row Maximum Limit Position */
#define ISC_PFE_CFG2_ROWMAX_Msk               (_U_(0xFFFF) << ISC_PFE_CFG2_ROWMAX_Pos)             /**< (ISC_PFE_CFG2) Row Maximum Limit Mask */
#define ISC_PFE_CFG2_ROWMAX(value)            (ISC_PFE_CFG2_ROWMAX_Msk & ((value) << ISC_PFE_CFG2_ROWMAX_Pos))
#define ISC_PFE_CFG2_Msk                      _U_(0xFFFFFFFF)                                      /**< (ISC_PFE_CFG2) Register Mask  */


/* -------- ISC_CLKEN : (ISC Offset: 0x18) ( /W 32) Clock Enable Register -------- */
#define ISC_CLKEN_ICEN_Pos                    _U_(0)                                               /**< (ISC_CLKEN) ISP Clock Enable Position */
#define ISC_CLKEN_ICEN_Msk                    (_U_(0x1) << ISC_CLKEN_ICEN_Pos)                     /**< (ISC_CLKEN) ISP Clock Enable Mask */
#define ISC_CLKEN_ICEN(value)                 (ISC_CLKEN_ICEN_Msk & ((value) << ISC_CLKEN_ICEN_Pos))
#define ISC_CLKEN_MCEN_Pos                    _U_(1)                                               /**< (ISC_CLKEN) Master Clock Enable Position */
#define ISC_CLKEN_MCEN_Msk                    (_U_(0x1) << ISC_CLKEN_MCEN_Pos)                     /**< (ISC_CLKEN) Master Clock Enable Mask */
#define ISC_CLKEN_MCEN(value)                 (ISC_CLKEN_MCEN_Msk & ((value) << ISC_CLKEN_MCEN_Pos))
#define ISC_CLKEN_Msk                         _U_(0x00000003)                                      /**< (ISC_CLKEN) Register Mask  */


/* -------- ISC_CLKDIS : (ISC Offset: 0x1C) ( /W 32) Clock Disable Register -------- */
#define ISC_CLKDIS_ICDIS_Pos                  _U_(0)                                               /**< (ISC_CLKDIS) ISP Clock Disable Position */
#define ISC_CLKDIS_ICDIS_Msk                  (_U_(0x1) << ISC_CLKDIS_ICDIS_Pos)                   /**< (ISC_CLKDIS) ISP Clock Disable Mask */
#define ISC_CLKDIS_ICDIS(value)               (ISC_CLKDIS_ICDIS_Msk & ((value) << ISC_CLKDIS_ICDIS_Pos))
#define ISC_CLKDIS_MCDIS_Pos                  _U_(1)                                               /**< (ISC_CLKDIS) Master Clock Disable Position */
#define ISC_CLKDIS_MCDIS_Msk                  (_U_(0x1) << ISC_CLKDIS_MCDIS_Pos)                   /**< (ISC_CLKDIS) Master Clock Disable Mask */
#define ISC_CLKDIS_MCDIS(value)               (ISC_CLKDIS_MCDIS_Msk & ((value) << ISC_CLKDIS_MCDIS_Pos))
#define ISC_CLKDIS_ICSWRST_Pos                _U_(8)                                               /**< (ISC_CLKDIS) ISP Clock Software Reset Position */
#define ISC_CLKDIS_ICSWRST_Msk                (_U_(0x1) << ISC_CLKDIS_ICSWRST_Pos)                 /**< (ISC_CLKDIS) ISP Clock Software Reset Mask */
#define ISC_CLKDIS_ICSWRST(value)             (ISC_CLKDIS_ICSWRST_Msk & ((value) << ISC_CLKDIS_ICSWRST_Pos))
#define ISC_CLKDIS_MCSWRST_Pos                _U_(9)                                               /**< (ISC_CLKDIS) Master Clock Software Reset Position */
#define ISC_CLKDIS_MCSWRST_Msk                (_U_(0x1) << ISC_CLKDIS_MCSWRST_Pos)                 /**< (ISC_CLKDIS) Master Clock Software Reset Mask */
#define ISC_CLKDIS_MCSWRST(value)             (ISC_CLKDIS_MCSWRST_Msk & ((value) << ISC_CLKDIS_MCSWRST_Pos))
#define ISC_CLKDIS_Msk                        _U_(0x00000303)                                      /**< (ISC_CLKDIS) Register Mask  */


/* -------- ISC_CLKSR : (ISC Offset: 0x20) ( R/ 32) Clock Status Register -------- */
#define ISC_CLKSR_ICSR_Pos                    _U_(0)                                               /**< (ISC_CLKSR) ISP Clock Status Register Position */
#define ISC_CLKSR_ICSR_Msk                    (_U_(0x1) << ISC_CLKSR_ICSR_Pos)                     /**< (ISC_CLKSR) ISP Clock Status Register Mask */
#define ISC_CLKSR_ICSR(value)                 (ISC_CLKSR_ICSR_Msk & ((value) << ISC_CLKSR_ICSR_Pos))
#define ISC_CLKSR_MCSR_Pos                    _U_(1)                                               /**< (ISC_CLKSR) Master Clock Status Register Position */
#define ISC_CLKSR_MCSR_Msk                    (_U_(0x1) << ISC_CLKSR_MCSR_Pos)                     /**< (ISC_CLKSR) Master Clock Status Register Mask */
#define ISC_CLKSR_MCSR(value)                 (ISC_CLKSR_MCSR_Msk & ((value) << ISC_CLKSR_MCSR_Pos))
#define ISC_CLKSR_SIP_Pos                     _U_(31)                                              /**< (ISC_CLKSR) Synchronization In Progress Position */
#define ISC_CLKSR_SIP_Msk                     (_U_(0x1) << ISC_CLKSR_SIP_Pos)                      /**< (ISC_CLKSR) Synchronization In Progress Mask */
#define ISC_CLKSR_SIP(value)                  (ISC_CLKSR_SIP_Msk & ((value) << ISC_CLKSR_SIP_Pos))
#define ISC_CLKSR_Msk                         _U_(0x80000003)                                      /**< (ISC_CLKSR) Register Mask  */


/* -------- ISC_CLKCFG : (ISC Offset: 0x24) (R/W 32) Clock Configuration Register -------- */
#define ISC_CLKCFG_ICDIV_Pos                  _U_(0)                                               /**< (ISC_CLKCFG) ISP Clock Divider Position */
#define ISC_CLKCFG_ICDIV_Msk                  (_U_(0xFF) << ISC_CLKCFG_ICDIV_Pos)                  /**< (ISC_CLKCFG) ISP Clock Divider Mask */
#define ISC_CLKCFG_ICDIV(value)               (ISC_CLKCFG_ICDIV_Msk & ((value) << ISC_CLKCFG_ICDIV_Pos))
#define ISC_CLKCFG_ICSEL_Pos                  _U_(8)                                               /**< (ISC_CLKCFG) ISP Clock Selection Position */
#define ISC_CLKCFG_ICSEL_Msk                  (_U_(0x1) << ISC_CLKCFG_ICSEL_Pos)                   /**< (ISC_CLKCFG) ISP Clock Selection Mask */
#define ISC_CLKCFG_ICSEL(value)               (ISC_CLKCFG_ICSEL_Msk & ((value) << ISC_CLKCFG_ICSEL_Pos))
#define ISC_CLKCFG_MCDIV_Pos                  _U_(16)                                              /**< (ISC_CLKCFG) Master Clock Divider Position */
#define ISC_CLKCFG_MCDIV_Msk                  (_U_(0xFF) << ISC_CLKCFG_MCDIV_Pos)                  /**< (ISC_CLKCFG) Master Clock Divider Mask */
#define ISC_CLKCFG_MCDIV(value)               (ISC_CLKCFG_MCDIV_Msk & ((value) << ISC_CLKCFG_MCDIV_Pos))
#define ISC_CLKCFG_MCSEL_Pos                  _U_(24)                                              /**< (ISC_CLKCFG) Master Clock Reference Clock Selection Position */
#define ISC_CLKCFG_MCSEL_Msk                  (_U_(0x3) << ISC_CLKCFG_MCSEL_Pos)                   /**< (ISC_CLKCFG) Master Clock Reference Clock Selection Mask */
#define ISC_CLKCFG_MCSEL(value)               (ISC_CLKCFG_MCSEL_Msk & ((value) << ISC_CLKCFG_MCSEL_Pos))
#define ISC_CLKCFG_Msk                        _U_(0x03FF01FF)                                      /**< (ISC_CLKCFG) Register Mask  */


/* -------- ISC_INTEN : (ISC Offset: 0x28) ( /W 32) Interrupt Enable Register -------- */
#define ISC_INTEN_VD_Pos                      _U_(0)                                               /**< (ISC_INTEN) Vertical Synchronization Detection Interrupt Enable Position */
#define ISC_INTEN_VD_Msk                      (_U_(0x1) << ISC_INTEN_VD_Pos)                       /**< (ISC_INTEN) Vertical Synchronization Detection Interrupt Enable Mask */
#define ISC_INTEN_VD(value)                   (ISC_INTEN_VD_Msk & ((value) << ISC_INTEN_VD_Pos))  
#define ISC_INTEN_HD_Pos                      _U_(1)                                               /**< (ISC_INTEN) Horizontal Synchronization Detection Interrupt Enable Position */
#define ISC_INTEN_HD_Msk                      (_U_(0x1) << ISC_INTEN_HD_Pos)                       /**< (ISC_INTEN) Horizontal Synchronization Detection Interrupt Enable Mask */
#define ISC_INTEN_HD(value)                   (ISC_INTEN_HD_Msk & ((value) << ISC_INTEN_HD_Pos))  
#define ISC_INTEN_SWRST_Pos                   _U_(4)                                               /**< (ISC_INTEN) Software Reset Completed Interrupt Enable Position */
#define ISC_INTEN_SWRST_Msk                   (_U_(0x1) << ISC_INTEN_SWRST_Pos)                    /**< (ISC_INTEN) Software Reset Completed Interrupt Enable Mask */
#define ISC_INTEN_SWRST(value)                (ISC_INTEN_SWRST_Msk & ((value) << ISC_INTEN_SWRST_Pos))
#define ISC_INTEN_DIS_Pos                     _U_(5)                                               /**< (ISC_INTEN) Disable Completed Interrupt Enable Position */
#define ISC_INTEN_DIS_Msk                     (_U_(0x1) << ISC_INTEN_DIS_Pos)                      /**< (ISC_INTEN) Disable Completed Interrupt Enable Mask */
#define ISC_INTEN_DIS(value)                  (ISC_INTEN_DIS_Msk & ((value) << ISC_INTEN_DIS_Pos))
#define ISC_INTEN_DDONE_Pos                   _U_(8)                                               /**< (ISC_INTEN) DMA Done Interrupt Enable Position */
#define ISC_INTEN_DDONE_Msk                   (_U_(0x1) << ISC_INTEN_DDONE_Pos)                    /**< (ISC_INTEN) DMA Done Interrupt Enable Mask */
#define ISC_INTEN_DDONE(value)                (ISC_INTEN_DDONE_Msk & ((value) << ISC_INTEN_DDONE_Pos))
#define ISC_INTEN_LDONE_Pos                   _U_(9)                                               /**< (ISC_INTEN) DMA List Done Interrupt Enable Position */
#define ISC_INTEN_LDONE_Msk                   (_U_(0x1) << ISC_INTEN_LDONE_Pos)                    /**< (ISC_INTEN) DMA List Done Interrupt Enable Mask */
#define ISC_INTEN_LDONE(value)                (ISC_INTEN_LDONE_Msk & ((value) << ISC_INTEN_LDONE_Pos))
#define ISC_INTEN_HISDONE_Pos                 _U_(12)                                              /**< (ISC_INTEN) Histogram Completed Interrupt Enable Position */
#define ISC_INTEN_HISDONE_Msk                 (_U_(0x1) << ISC_INTEN_HISDONE_Pos)                  /**< (ISC_INTEN) Histogram Completed Interrupt Enable Mask */
#define ISC_INTEN_HISDONE(value)              (ISC_INTEN_HISDONE_Msk & ((value) << ISC_INTEN_HISDONE_Pos))
#define ISC_INTEN_HISCLR_Pos                  _U_(13)                                              /**< (ISC_INTEN) Histogram Clear Interrupt Enable Position */
#define ISC_INTEN_HISCLR_Msk                  (_U_(0x1) << ISC_INTEN_HISCLR_Pos)                   /**< (ISC_INTEN) Histogram Clear Interrupt Enable Mask */
#define ISC_INTEN_HISCLR(value)               (ISC_INTEN_HISCLR_Msk & ((value) << ISC_INTEN_HISCLR_Pos))
#define ISC_INTEN_WERR_Pos                    _U_(16)                                              /**< (ISC_INTEN) Write Channel Error Interrupt Enable Position */
#define ISC_INTEN_WERR_Msk                    (_U_(0x1) << ISC_INTEN_WERR_Pos)                     /**< (ISC_INTEN) Write Channel Error Interrupt Enable Mask */
#define ISC_INTEN_WERR(value)                 (ISC_INTEN_WERR_Msk & ((value) << ISC_INTEN_WERR_Pos))
#define ISC_INTEN_RERR_Pos                    _U_(20)                                              /**< (ISC_INTEN) Read Channel Error Interrupt Enable Position */
#define ISC_INTEN_RERR_Msk                    (_U_(0x1) << ISC_INTEN_RERR_Pos)                     /**< (ISC_INTEN) Read Channel Error Interrupt Enable Mask */
#define ISC_INTEN_RERR(value)                 (ISC_INTEN_RERR_Msk & ((value) << ISC_INTEN_RERR_Pos))
#define ISC_INTEN_VFPOV_Pos                   _U_(24)                                              /**< (ISC_INTEN) Vertical Front Porch Overflow Interrupt Enable Position */
#define ISC_INTEN_VFPOV_Msk                   (_U_(0x1) << ISC_INTEN_VFPOV_Pos)                    /**< (ISC_INTEN) Vertical Front Porch Overflow Interrupt Enable Mask */
#define ISC_INTEN_VFPOV(value)                (ISC_INTEN_VFPOV_Msk & ((value) << ISC_INTEN_VFPOV_Pos))
#define ISC_INTEN_DAOV_Pos                    _U_(25)                                              /**< (ISC_INTEN) Data Overflow Interrupt Enable Position */
#define ISC_INTEN_DAOV_Msk                    (_U_(0x1) << ISC_INTEN_DAOV_Pos)                     /**< (ISC_INTEN) Data Overflow Interrupt Enable Mask */
#define ISC_INTEN_DAOV(value)                 (ISC_INTEN_DAOV_Msk & ((value) << ISC_INTEN_DAOV_Pos))
#define ISC_INTEN_VDTO_Pos                    _U_(26)                                              /**< (ISC_INTEN) Vertical Synchronization Timeout Interrupt Enable Position */
#define ISC_INTEN_VDTO_Msk                    (_U_(0x1) << ISC_INTEN_VDTO_Pos)                     /**< (ISC_INTEN) Vertical Synchronization Timeout Interrupt Enable Mask */
#define ISC_INTEN_VDTO(value)                 (ISC_INTEN_VDTO_Msk & ((value) << ISC_INTEN_VDTO_Pos))
#define ISC_INTEN_HDTO_Pos                    _U_(27)                                              /**< (ISC_INTEN) Horizontal Synchronization Timeout Interrupt Enable Position */
#define ISC_INTEN_HDTO_Msk                    (_U_(0x1) << ISC_INTEN_HDTO_Pos)                     /**< (ISC_INTEN) Horizontal Synchronization Timeout Interrupt Enable Mask */
#define ISC_INTEN_HDTO(value)                 (ISC_INTEN_HDTO_Msk & ((value) << ISC_INTEN_HDTO_Pos))
#define ISC_INTEN_CCIRERR_Pos                 _U_(28)                                              /**< (ISC_INTEN) CCIR Decoder Error Interrupt Enable Position */
#define ISC_INTEN_CCIRERR_Msk                 (_U_(0x1) << ISC_INTEN_CCIRERR_Pos)                  /**< (ISC_INTEN) CCIR Decoder Error Interrupt Enable Mask */
#define ISC_INTEN_CCIRERR(value)              (ISC_INTEN_CCIRERR_Msk & ((value) << ISC_INTEN_CCIRERR_Pos))
#define ISC_INTEN_Msk                         _U_(0x1F113333)                                      /**< (ISC_INTEN) Register Mask  */


/* -------- ISC_INTDIS : (ISC Offset: 0x2C) ( /W 32) Interrupt Disable Register -------- */
#define ISC_INTDIS_VD_Pos                     _U_(0)                                               /**< (ISC_INTDIS) Vertical Synchronization Detection Interrupt Disable Position */
#define ISC_INTDIS_VD_Msk                     (_U_(0x1) << ISC_INTDIS_VD_Pos)                      /**< (ISC_INTDIS) Vertical Synchronization Detection Interrupt Disable Mask */
#define ISC_INTDIS_VD(value)                  (ISC_INTDIS_VD_Msk & ((value) << ISC_INTDIS_VD_Pos))
#define ISC_INTDIS_HD_Pos                     _U_(1)                                               /**< (ISC_INTDIS) Horizontal Synchronization Detection Interrupt Disable Position */
#define ISC_INTDIS_HD_Msk                     (_U_(0x1) << ISC_INTDIS_HD_Pos)                      /**< (ISC_INTDIS) Horizontal Synchronization Detection Interrupt Disable Mask */
#define ISC_INTDIS_HD(value)                  (ISC_INTDIS_HD_Msk & ((value) << ISC_INTDIS_HD_Pos))
#define ISC_INTDIS_SWRST_Pos                  _U_(4)                                               /**< (ISC_INTDIS) Software Reset Completed Interrupt Disable Position */
#define ISC_INTDIS_SWRST_Msk                  (_U_(0x1) << ISC_INTDIS_SWRST_Pos)                   /**< (ISC_INTDIS) Software Reset Completed Interrupt Disable Mask */
#define ISC_INTDIS_SWRST(value)               (ISC_INTDIS_SWRST_Msk & ((value) << ISC_INTDIS_SWRST_Pos))
#define ISC_INTDIS_DIS_Pos                    _U_(5)                                               /**< (ISC_INTDIS) Disable Completed Interrupt Disable Position */
#define ISC_INTDIS_DIS_Msk                    (_U_(0x1) << ISC_INTDIS_DIS_Pos)                     /**< (ISC_INTDIS) Disable Completed Interrupt Disable Mask */
#define ISC_INTDIS_DIS(value)                 (ISC_INTDIS_DIS_Msk & ((value) << ISC_INTDIS_DIS_Pos))
#define ISC_INTDIS_DDONE_Pos                  _U_(8)                                               /**< (ISC_INTDIS) DMA Done Interrupt Disable Position */
#define ISC_INTDIS_DDONE_Msk                  (_U_(0x1) << ISC_INTDIS_DDONE_Pos)                   /**< (ISC_INTDIS) DMA Done Interrupt Disable Mask */
#define ISC_INTDIS_DDONE(value)               (ISC_INTDIS_DDONE_Msk & ((value) << ISC_INTDIS_DDONE_Pos))
#define ISC_INTDIS_LDONE_Pos                  _U_(9)                                               /**< (ISC_INTDIS) DMA List Done Interrupt Disable Position */
#define ISC_INTDIS_LDONE_Msk                  (_U_(0x1) << ISC_INTDIS_LDONE_Pos)                   /**< (ISC_INTDIS) DMA List Done Interrupt Disable Mask */
#define ISC_INTDIS_LDONE(value)               (ISC_INTDIS_LDONE_Msk & ((value) << ISC_INTDIS_LDONE_Pos))
#define ISC_INTDIS_HISDONE_Pos                _U_(12)                                              /**< (ISC_INTDIS) Histogram Completed Interrupt Disable Position */
#define ISC_INTDIS_HISDONE_Msk                (_U_(0x1) << ISC_INTDIS_HISDONE_Pos)                 /**< (ISC_INTDIS) Histogram Completed Interrupt Disable Mask */
#define ISC_INTDIS_HISDONE(value)             (ISC_INTDIS_HISDONE_Msk & ((value) << ISC_INTDIS_HISDONE_Pos))
#define ISC_INTDIS_HISCLR_Pos                 _U_(13)                                              /**< (ISC_INTDIS) Histogram Clear Interrupt Disable Position */
#define ISC_INTDIS_HISCLR_Msk                 (_U_(0x1) << ISC_INTDIS_HISCLR_Pos)                  /**< (ISC_INTDIS) Histogram Clear Interrupt Disable Mask */
#define ISC_INTDIS_HISCLR(value)              (ISC_INTDIS_HISCLR_Msk & ((value) << ISC_INTDIS_HISCLR_Pos))
#define ISC_INTDIS_WERR_Pos                   _U_(16)                                              /**< (ISC_INTDIS) Write Channel Error Interrupt Disable Position */
#define ISC_INTDIS_WERR_Msk                   (_U_(0x1) << ISC_INTDIS_WERR_Pos)                    /**< (ISC_INTDIS) Write Channel Error Interrupt Disable Mask */
#define ISC_INTDIS_WERR(value)                (ISC_INTDIS_WERR_Msk & ((value) << ISC_INTDIS_WERR_Pos))
#define ISC_INTDIS_RERR_Pos                   _U_(20)                                              /**< (ISC_INTDIS) Read Channel Error Interrupt Disable Position */
#define ISC_INTDIS_RERR_Msk                   (_U_(0x1) << ISC_INTDIS_RERR_Pos)                    /**< (ISC_INTDIS) Read Channel Error Interrupt Disable Mask */
#define ISC_INTDIS_RERR(value)                (ISC_INTDIS_RERR_Msk & ((value) << ISC_INTDIS_RERR_Pos))
#define ISC_INTDIS_VFPOV_Pos                  _U_(24)                                              /**< (ISC_INTDIS) Vertical Front Porch Overflow Interrupt Disable Position */
#define ISC_INTDIS_VFPOV_Msk                  (_U_(0x1) << ISC_INTDIS_VFPOV_Pos)                   /**< (ISC_INTDIS) Vertical Front Porch Overflow Interrupt Disable Mask */
#define ISC_INTDIS_VFPOV(value)               (ISC_INTDIS_VFPOV_Msk & ((value) << ISC_INTDIS_VFPOV_Pos))
#define ISC_INTDIS_DAOV_Pos                   _U_(25)                                              /**< (ISC_INTDIS) Data Overflow Interrupt Disable Position */
#define ISC_INTDIS_DAOV_Msk                   (_U_(0x1) << ISC_INTDIS_DAOV_Pos)                    /**< (ISC_INTDIS) Data Overflow Interrupt Disable Mask */
#define ISC_INTDIS_DAOV(value)                (ISC_INTDIS_DAOV_Msk & ((value) << ISC_INTDIS_DAOV_Pos))
#define ISC_INTDIS_VDTO_Pos                   _U_(26)                                              /**< (ISC_INTDIS) Vertical Synchronization Timeout Interrupt Disable Position */
#define ISC_INTDIS_VDTO_Msk                   (_U_(0x1) << ISC_INTDIS_VDTO_Pos)                    /**< (ISC_INTDIS) Vertical Synchronization Timeout Interrupt Disable Mask */
#define ISC_INTDIS_VDTO(value)                (ISC_INTDIS_VDTO_Msk & ((value) << ISC_INTDIS_VDTO_Pos))
#define ISC_INTDIS_HDTO_Pos                   _U_(27)                                              /**< (ISC_INTDIS) Horizontal Synchronization Timeout Interrupt Disable Position */
#define ISC_INTDIS_HDTO_Msk                   (_U_(0x1) << ISC_INTDIS_HDTO_Pos)                    /**< (ISC_INTDIS) Horizontal Synchronization Timeout Interrupt Disable Mask */
#define ISC_INTDIS_HDTO(value)                (ISC_INTDIS_HDTO_Msk & ((value) << ISC_INTDIS_HDTO_Pos))
#define ISC_INTDIS_CCIRERR_Pos                _U_(28)                                              /**< (ISC_INTDIS) CCIR Decoder Error Interrupt Disable Position */
#define ISC_INTDIS_CCIRERR_Msk                (_U_(0x1) << ISC_INTDIS_CCIRERR_Pos)                 /**< (ISC_INTDIS) CCIR Decoder Error Interrupt Disable Mask */
#define ISC_INTDIS_CCIRERR(value)             (ISC_INTDIS_CCIRERR_Msk & ((value) << ISC_INTDIS_CCIRERR_Pos))
#define ISC_INTDIS_Msk                        _U_(0x1F113333)                                      /**< (ISC_INTDIS) Register Mask  */


