virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27_DFP/component/isc.h
#define ISC_GAM_GENTRY59_REG_OFST      (0x284)             /**< (ISC_GAM_GENTRY59) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY60_REG_OFST      (0x288)             /**< (ISC_GAM_GENTRY60) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY61_REG_OFST      (0x28C)             /**< (ISC_GAM_GENTRY61) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY62_REG_OFST      (0x290)             /**< (ISC_GAM_GENTRY62) Gamma Correction Green Entry Offset */
#define ISC_GAM_GENTRY63_REG_OFST      (0x294)             /**< (ISC_GAM_GENTRY63) Gamma Correction Green Entry Offset */
#define ISC_GAM_RENTRY_REG_OFST        (0x298)             /**< (ISC_GAM_RENTRY) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY0_REG_OFST       (0x298)             /**< (ISC_GAM_RENTRY0) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY1_REG_OFST       (0x29C)             /**< (ISC_GAM_RENTRY1) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY2_REG_OFST       (0x2A0)             /**< (ISC_GAM_RENTRY2) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY3_REG_OFST       (0x2A4)             /**< (ISC_GAM_RENTRY3) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY4_REG_OFST       (0x2A8)             /**< (ISC_GAM_RENTRY4) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY5_REG_OFST       (0x2AC)             /**< (ISC_GAM_RENTRY5) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY6_REG_OFST       (0x2B0)             /**< (ISC_GAM_RENTRY6) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY7_REG_OFST       (0x2B4)             /**< (ISC_GAM_RENTRY7) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY8_REG_OFST       (0x2B8)             /**< (ISC_GAM_RENTRY8) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY9_REG_OFST       (0x2BC)             /**< (ISC_GAM_RENTRY9) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY10_REG_OFST      (0x2C0)             /**< (ISC_GAM_RENTRY10) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY11_REG_OFST      (0x2C4)             /**< (ISC_GAM_RENTRY11) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY12_REG_OFST      (0x2C8)             /**< (ISC_GAM_RENTRY12) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY13_REG_OFST      (0x2CC)             /**< (ISC_GAM_RENTRY13) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY14_REG_OFST      (0x2D0)             /**< (ISC_GAM_RENTRY14) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY15_REG_OFST      (0x2D4)             /**< (ISC_GAM_RENTRY15) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY16_REG_OFST      (0x2D8)             /**< (ISC_GAM_RENTRY16) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY17_REG_OFST      (0x2DC)             /**< (ISC_GAM_RENTRY17) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY18_REG_OFST      (0x2E0)             /**< (ISC_GAM_RENTRY18) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY19_REG_OFST      (0x2E4)             /**< (ISC_GAM_RENTRY19) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY20_REG_OFST      (0x2E8)             /**< (ISC_GAM_RENTRY20) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY21_REG_OFST      (0x2EC)             /**< (ISC_GAM_RENTRY21) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY22_REG_OFST      (0x2F0)             /**< (ISC_GAM_RENTRY22) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY23_REG_OFST      (0x2F4)             /**< (ISC_GAM_RENTRY23) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY24_REG_OFST      (0x2F8)             /**< (ISC_GAM_RENTRY24) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY25_REG_OFST      (0x2FC)             /**< (ISC_GAM_RENTRY25) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY26_REG_OFST      (0x300)             /**< (ISC_GAM_RENTRY26) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY27_REG_OFST      (0x304)             /**< (ISC_GAM_RENTRY27) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY28_REG_OFST      (0x308)             /**< (ISC_GAM_RENTRY28) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY29_REG_OFST      (0x30C)             /**< (ISC_GAM_RENTRY29) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY30_REG_OFST      (0x310)             /**< (ISC_GAM_RENTRY30) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY31_REG_OFST      (0x314)             /**< (ISC_GAM_RENTRY31) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY32_REG_OFST      (0x318)             /**< (ISC_GAM_RENTRY32) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY33_REG_OFST      (0x31C)             /**< (ISC_GAM_RENTRY33) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY34_REG_OFST      (0x320)             /**< (ISC_GAM_RENTRY34) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY35_REG_OFST      (0x324)             /**< (ISC_GAM_RENTRY35) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY36_REG_OFST      (0x328)             /**< (ISC_GAM_RENTRY36) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY37_REG_OFST      (0x32C)             /**< (ISC_GAM_RENTRY37) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY38_REG_OFST      (0x330)             /**< (ISC_GAM_RENTRY38) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY39_REG_OFST      (0x334)             /**< (ISC_GAM_RENTRY39) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY40_REG_OFST      (0x338)             /**< (ISC_GAM_RENTRY40) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY41_REG_OFST      (0x33C)             /**< (ISC_GAM_RENTRY41) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY42_REG_OFST      (0x340)             /**< (ISC_GAM_RENTRY42) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY43_REG_OFST      (0x344)             /**< (ISC_GAM_RENTRY43) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY44_REG_OFST      (0x348)             /**< (ISC_GAM_RENTRY44) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY45_REG_OFST      (0x34C)             /**< (ISC_GAM_RENTRY45) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY46_REG_OFST      (0x350)             /**< (ISC_GAM_RENTRY46) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY47_REG_OFST      (0x354)             /**< (ISC_GAM_RENTRY47) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY48_REG_OFST      (0x358)             /**< (ISC_GAM_RENTRY48) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY49_REG_OFST      (0x35C)             /**< (ISC_GAM_RENTRY49) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY50_REG_OFST      (0x360)             /**< (ISC_GAM_RENTRY50) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY51_REG_OFST      (0x364)             /**< (ISC_GAM_RENTRY51) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY52_REG_OFST      (0x368)             /**< (ISC_GAM_RENTRY52) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY53_REG_OFST      (0x36C)             /**< (ISC_GAM_RENTRY53) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY54_REG_OFST      (0x370)             /**< (ISC_GAM_RENTRY54) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY55_REG_OFST      (0x374)             /**< (ISC_GAM_RENTRY55) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY56_REG_OFST      (0x378)             /**< (ISC_GAM_RENTRY56) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY57_REG_OFST      (0x37C)             /**< (ISC_GAM_RENTRY57) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY58_REG_OFST      (0x380)             /**< (ISC_GAM_RENTRY58) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY59_REG_OFST      (0x384)             /**< (ISC_GAM_RENTRY59) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY60_REG_OFST      (0x388)             /**< (ISC_GAM_RENTRY60) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY61_REG_OFST      (0x38C)             /**< (ISC_GAM_RENTRY61) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY62_REG_OFST      (0x390)             /**< (ISC_GAM_RENTRY62) Gamma Correction Red Entry Offset */
#define ISC_GAM_RENTRY63_REG_OFST      (0x394)             /**< (ISC_GAM_RENTRY63) Gamma Correction Red Entry Offset */
#define ISC_CSC_CTRL_REG_OFST          (0x398)             /**< (ISC_CSC_CTRL) Color Space Conversion Control Register Offset */
#define ISC_CSC_YR_YG_REG_OFST         (0x39C)             /**< (ISC_CSC_YR_YG) Color Space Conversion YR, YG Register Offset */
#define ISC_CSC_YB_OY_REG_OFST         (0x3A0)             /**< (ISC_CSC_YB_OY) Color Space Conversion YB, OY Register Offset */
#define ISC_CSC_CBR_CBG_REG_OFST       (0x3A4)             /**< (ISC_CSC_CBR_CBG) Color Space Conversion CBR CBG Register Offset */
#define ISC_CSC_CBB_OCB_REG_OFST       (0x3A8)             /**< (ISC_CSC_CBB_OCB) Color Space Conversion CBB OCB Register Offset */
#define ISC_CSC_CRR_CRG_REG_OFST       (0x3AC)             /**< (ISC_CSC_CRR_CRG) Color Space Conversion CRR CRG Register Offset */
#define ISC_CSC_CRB_OCR_REG_OFST       (0x3B0)             /**< (ISC_CSC_CRB_OCR) Color Space Conversion CRB OCR Register Offset */
#define ISC_CBC_CTRL_REG_OFST          (0x3B4)             /**< (ISC_CBC_CTRL) Contrast and Brightness Control Register Offset */
#define ISC_CBC_CFG_REG_OFST           (0x3B8)             /**< (ISC_CBC_CFG) Contrast and Brightness Configuration Register Offset */
#define ISC_CBC_BRIGHT_REG_OFST        (0x3BC)             /**< (ISC_CBC_BRIGHT) Contrast and Brightness, Brightness Register Offset */
#define ISC_CBC_CONTRAST_REG_OFST      (0x3C0)             /**< (ISC_CBC_CONTRAST) Contrast and Brightness, Contrast Register Offset */
#define ISC_SUB422_CTRL_REG_OFST       (0x3C4)             /**< (ISC_SUB422_CTRL) Subsampling 4:4:4 to 4:2:2 Control Register Offset */
#define ISC_SUB422_CFG_REG_OFST        (0x3C8)             /**< (ISC_SUB422_CFG) Subsampling 4:4:4 to 4:2:2 Configuration Register Offset */
#define ISC_SUB420_CTRL_REG_OFST       (0x3CC)             /**< (ISC_SUB420_CTRL) Subsampling 4:2:2 to 4:2:0 Control Register Offset */
#define ISC_RLP_CFG_REG_OFST           (0x3D0)             /**< (ISC_RLP_CFG) Rounding, Limiting and Packing Configuration Register Offset */
#define ISC_HIS_CTRL_REG_OFST          (0x3D4)             /**< (ISC_HIS_CTRL) Histogram Control Register Offset */
#define ISC_HIS_CFG_REG_OFST           (0x3D8)             /**< (ISC_HIS_CFG) Histogram Configuration Register Offset */
#define ISC_DCFG_REG_OFST              (0x3E0)             /**< (ISC_DCFG) DMA Configuration Register Offset */
#define ISC_DCTRL_REG_OFST             (0x3E4)             /**< (ISC_DCTRL) DMA Control Register Offset */
#define ISC_DNDA_REG_OFST              (0x3E8)             /**< (ISC_DNDA) DMA Descriptor Address Register Offset */
#define ISC_HIS_ENTRY_REG_OFST         (0x410)             /**< (ISC_HIS_ENTRY) Histogram Entry Offset */
#define ISC_HIS_ENTRY0_REG_OFST        (0x410)             /**< (ISC_HIS_ENTRY0) Histogram Entry Offset */
#define ISC_HIS_ENTRY1_REG_OFST        (0x414)             /**< (ISC_HIS_ENTRY1) Histogram Entry Offset */
#define ISC_HIS_ENTRY2_REG_OFST        (0x418)             /**< (ISC_HIS_ENTRY2) Histogram Entry Offset */
#define ISC_HIS_ENTRY3_REG_OFST        (0x41C)             /**< (ISC_HIS_ENTRY3) Histogram Entry Offset */
#define ISC_HIS_ENTRY4_REG_OFST        (0x420)             /**< (ISC_HIS_ENTRY4) Histogram Entry Offset */
#define ISC_HIS_ENTRY5_REG_OFST        (0x424)             /**< (ISC_HIS_ENTRY5) Histogram Entry Offset */
#define ISC_HIS_ENTRY6_REG_OFST        (0x428)             /**< (ISC_HIS_ENTRY6) Histogram Entry Offset */
#define ISC_HIS_ENTRY7_REG_OFST        (0x42C)             /**< (ISC_HIS_ENTRY7) Histogram Entry Offset */
#define ISC_HIS_ENTRY8_REG_OFST        (0x430)             /**< (ISC_HIS_ENTRY8) Histogram Entry Offset */
#define ISC_HIS_ENTRY9_REG_OFST        (0x434)             /**< (ISC_HIS_ENTRY9) Histogram Entry Offset */
#define ISC_HIS_ENTRY10_REG_OFST       (0x438)             /**< (ISC_HIS_ENTRY10) Histogram Entry Offset */
#define ISC_HIS_ENTRY11_REG_OFST       (0x43C)             /**< (ISC_HIS_ENTRY11) Histogram Entry Offset */
#define ISC_HIS_ENTRY12_REG_OFST       (0x440)             /**< (ISC_HIS_ENTRY12) Histogram Entry Offset */
#define ISC_HIS_ENTRY13_REG_OFST       (0x444)             /**< (ISC_HIS_ENTRY13) Histogram Entry Offset */
#define ISC_HIS_ENTRY14_REG_OFST       (0x448)             /**< (ISC_HIS_ENTRY14) Histogram Entry Offset */
#define ISC_HIS_ENTRY15_REG_OFST       (0x44C)             /**< (ISC_HIS_ENTRY15) Histogram Entry Offset */
#define ISC_HIS_ENTRY16_REG_OFST       (0x450)             /**< (ISC_HIS_ENTRY16) Histogram Entry Offset */
#define ISC_HIS_ENTRY17_REG_OFST       (0x454)             /**< (ISC_HIS_ENTRY17) Histogram Entry Offset */
#define ISC_HIS_ENTRY18_REG_OFST       (0x458)             /**< (ISC_HIS_ENTRY18) Histogram Entry Offset */
#define ISC_HIS_ENTRY19_REG_OFST       (0x45C)             /**< (ISC_HIS_ENTRY19) Histogram Entry Offset */
#define ISC_HIS_ENTRY20_REG_OFST       (0x460)             /**< (ISC_HIS_ENTRY20) Histogram Entry Offset */
#define ISC_HIS_ENTRY21_REG_OFST       (0x464)             /**< (ISC_HIS_ENTRY21) Histogram Entry Offset */
#define ISC_HIS_ENTRY22_REG_OFST       (0x468)             /**< (ISC_HIS_ENTRY22) Histogram Entry Offset */
#define ISC_HIS_ENTRY23_REG_OFST       (0x46C)             /**< (ISC_HIS_ENTRY23) Histogram Entry Offset */
#define ISC_HIS_ENTRY24_REG_OFST       (0x470)             /**< (ISC_HIS_ENTRY24) Histogram Entry Offset */
#define ISC_HIS_ENTRY25_REG_OFST       (0x474)             /**< (ISC_HIS_ENTRY25) Histogram Entry Offset */
#define ISC_HIS_ENTRY26_REG_OFST       (0x478)             /**< (ISC_HIS_ENTRY26) Histogram Entry Offset */
#define ISC_HIS_ENTRY27_REG_OFST       (0x47C)             /**< (ISC_HIS_ENTRY27) Histogram Entry Offset */
#define ISC_HIS_ENTRY28_REG_OFST       (0x480)             /**< (ISC_HIS_ENTRY28) Histogram Entry Offset */
#define ISC_HIS_ENTRY29_REG_OFST       (0x484)             /**< (ISC_HIS_ENTRY29) Histogram Entry Offset */
#define ISC_HIS_ENTRY30_REG_OFST       (0x488)             /**< (ISC_HIS_ENTRY30) Histogram Entry Offset */
#define ISC_HIS_ENTRY31_REG_OFST       (0x48C)             /**< (ISC_HIS_ENTRY31) Histogram Entry Offset */
#define ISC_HIS_ENTRY32_REG_OFST       (0x490)             /**< (ISC_HIS_ENTRY32) Histogram Entry Offset */
#define ISC_HIS_ENTRY33_REG_OFST       (0x494)             /**< (ISC_HIS_ENTRY33) Histogram Entry Offset */
#define ISC_HIS_ENTRY34_REG_OFST       (0x498)             /**< (ISC_HIS_ENTRY34) Histogram Entry Offset */
#define ISC_HIS_ENTRY35_REG_OFST       (0x49C)             /**< (ISC_HIS_ENTRY35) Histogram Entry Offset */
#define ISC_HIS_ENTRY36_REG_OFST       (0x4A0)             /**< (ISC_HIS_ENTRY36) Histogram Entry Offset */
#define ISC_HIS_ENTRY37_REG_OFST       (0x4A4)             /**< (ISC_HIS_ENTRY37) Histogram Entry Offset */
#define ISC_HIS_ENTRY38_REG_OFST       (0x4A8)             /**< (ISC_HIS_ENTRY38) Histogram Entry Offset */
#define ISC_HIS_ENTRY39_REG_OFST       (0x4AC)             /**< (ISC_HIS_ENTRY39) Histogram Entry Offset */
#define ISC_HIS_ENTRY40_REG_OFST       (0x4B0)             /**< (ISC_HIS_ENTRY40) Histogram Entry Offset */
#define ISC_HIS_ENTRY41_REG_OFST       (0x4B4)             /**< (ISC_HIS_ENTRY41) Histogram Entry Offset */
#define ISC_HIS_ENTRY42_REG_OFST       (0x4B8)             /**< (ISC_HIS_ENTRY42) Histogram Entry Offset */
#define ISC_HIS_ENTRY43_REG_OFST       (0x4BC)             /**< (ISC_HIS_ENTRY43) Histogram Entry Offset */
#define ISC_HIS_ENTRY44_REG_OFST       (0x4C0)             /**< (ISC_HIS_ENTRY44) Histogram Entry Offset */
#define ISC_HIS_ENTRY45_REG_OFST       (0x4C4)             /**< (ISC_HIS_ENTRY45) Histogram Entry Offset */
#define ISC_HIS_ENTRY46_REG_OFST       (0x4C8)             /**< (ISC_HIS_ENTRY46) Histogram Entry Offset */
#define ISC_HIS_ENTRY47_REG_OFST       (0x4CC)             /**< (ISC_HIS_ENTRY47) Histogram Entry Offset */
#define ISC_HIS_ENTRY48_REG_OFST       (0x4D0)             /**< (ISC_HIS_ENTRY48) Histogram Entry Offset */
#define ISC_HIS_ENTRY49_REG_OFST       (0x4D4)             /**< (ISC_HIS_ENTRY49) Histogram Entry Offset */
#define ISC_HIS_ENTRY50_REG_OFST       (0x4D8)             /**< (ISC_HIS_ENTRY50) Histogram Entry Offset */
#define ISC_HIS_ENTRY51_REG_OFST       (0x4DC)             /**< (ISC_HIS_ENTRY51) Histogram Entry Offset */
#define ISC_HIS_ENTRY52_REG_OFST       (0x4E0)             /**< (ISC_HIS_ENTRY52) Histogram Entry Offset */
#define ISC_HIS_ENTRY53_REG_OFST       (0x4E4)             /**< (ISC_HIS_ENTRY53) Histogram Entry Offset */
#define ISC_HIS_ENTRY54_REG_OFST       (0x4E8)             /**< (ISC_HIS_ENTRY54) Histogram Entry Offset */
#define ISC_HIS_ENTRY55_REG_OFST       (0x4EC)             /**< (ISC_HIS_ENTRY55) Histogram Entry Offset */
#define ISC_HIS_ENTRY56_REG_OFST       (0x4F0)             /**< (ISC_HIS_ENTRY56) Histogram Entry Offset */
#define ISC_HIS_ENTRY57_REG_OFST       (0x4F4)             /**< (ISC_HIS_ENTRY57) Histogram Entry Offset */
#define ISC_HIS_ENTRY58_REG_OFST       (0x4F8)             /**< (ISC_HIS_ENTRY58) Histogram Entry Offset */
#define ISC_HIS_ENTRY59_REG_OFST       (0x4FC)             /**< (ISC_HIS_ENTRY59) Histogram Entry Offset */
#define ISC_HIS_ENTRY60_REG_OFST       (0x500)             /**< (ISC_HIS_ENTRY60) Histogram Entry Offset */
#define ISC_HIS_ENTRY61_REG_OFST       (0x504)             /**< (ISC_HIS_ENTRY61) Histogram Entry Offset */
#define ISC_HIS_ENTRY62_REG_OFST       (0x508)             /**< (ISC_HIS_ENTRY62) Histogram Entry Offset */
#define ISC_HIS_ENTRY63_REG_OFST       (0x50C)             /**< (ISC_HIS_ENTRY63) Histogram Entry Offset */
#define ISC_HIS_ENTRY64_REG_OFST       (0x510)             /**< (ISC_HIS_ENTRY64) Histogram Entry Offset */
#define ISC_HIS_ENTRY65_REG_OFST       (0x514)             /**< (ISC_HIS_ENTRY65) Histogram Entry Offset */
#define ISC_HIS_ENTRY66_REG_OFST       (0x518)             /**< (ISC_HIS_ENTRY66) Histogram Entry Offset */
#define ISC_HIS_ENTRY67_REG_OFST       (0x51C)             /**< (ISC_HIS_ENTRY67) Histogram Entry Offset */
#define ISC_HIS_ENTRY68_REG_OFST       (0x520)             /**< (ISC_HIS_ENTRY68) Histogram Entry Offset */
#define ISC_HIS_ENTRY69_REG_OFST       (0x524)             /**< (ISC_HIS_ENTRY69) Histogram Entry Offset */
#define ISC_HIS_ENTRY70_REG_OFST       (0x528)             /**< (ISC_HIS_ENTRY70) Histogram Entry Offset */
#define ISC_HIS_ENTRY71_REG_OFST       (0x52C)             /**< (ISC_HIS_ENTRY71) Histogram Entry Offset */
#define ISC_HIS_ENTRY72_REG_OFST       (0x530)             /**< (ISC_HIS_ENTRY72) Histogram Entry Offset */
#define ISC_HIS_ENTRY73_REG_OFST       (0x534)             /**< (ISC_HIS_ENTRY73) Histogram Entry Offset */
#define ISC_HIS_ENTRY74_REG_OFST       (0x538)             /**< (ISC_HIS_ENTRY74) Histogram Entry Offset */
#define ISC_HIS_ENTRY75_REG_OFST       (0x53C)             /**< (ISC_HIS_ENTRY75) Histogram Entry Offset */
#define ISC_HIS_ENTRY76_REG_OFST       (0x540)             /**< (ISC_HIS_ENTRY76) Histogram Entry Offset */
#define ISC_HIS_ENTRY77_REG_OFST       (0x544)             /**< (ISC_HIS_ENTRY77) Histogram Entry Offset */
#define ISC_HIS_ENTRY78_REG_OFST       (0x548)             /**< (ISC_HIS_ENTRY78) Histogram Entry Offset */
#define ISC_HIS_ENTRY79_REG_OFST       (0x54C)             /**< (ISC_HIS_ENTRY79) Histogram Entry Offset */
#define ISC_HIS_ENTRY80_REG_OFST       (0x550)             /**< (ISC_HIS_ENTRY80) Histogram Entry Offset */
#define ISC_HIS_ENTRY81_REG_OFST       (0x554)             /**< (ISC_HIS_ENTRY81) Histogram Entry Offset */
#define ISC_HIS_ENTRY82_REG_OFST       (0x558)             /**< (ISC_HIS_ENTRY82) Histogram Entry Offset */
#define ISC_HIS_ENTRY83_REG_OFST       (0x55C)             /**< (ISC_HIS_ENTRY83) Histogram Entry Offset */
#define ISC_HIS_ENTRY84_REG_OFST       (0x560)             /**< (ISC_HIS_ENTRY84) Histogram Entry Offset */
#define ISC_HIS_ENTRY85_REG_OFST       (0x564)             /**< (ISC_HIS_ENTRY85) Histogram Entry Offset */
#define ISC_HIS_ENTRY86_REG_OFST       (0x568)             /**< (ISC_HIS_ENTRY86) Histogram Entry Offset */
#define ISC_HIS_ENTRY87_REG_OFST       (0x56C)             /**< (ISC_HIS_ENTRY87) Histogram Entry Offset */
#define ISC_HIS_ENTRY88_REG_OFST       (0x570)             /**< (ISC_HIS_ENTRY88) Histogram Entry Offset */
#define ISC_HIS_ENTRY89_REG_OFST       (0x574)             /**< (ISC_HIS_ENTRY89) Histogram Entry Offset */
#define ISC_HIS_ENTRY90_REG_OFST       (0x578)             /**< (ISC_HIS_ENTRY90) Histogram Entry Offset */
#define ISC_HIS_ENTRY91_REG_OFST       (0x57C)             /**< (ISC_HIS_ENTRY91) Histogram Entry Offset */
#define ISC_HIS_ENTRY92_REG_OFST       (0x580)             /**< (ISC_HIS_ENTRY92) Histogram Entry Offset */
#define ISC_HIS_ENTRY93_REG_OFST       (0x584)             /**< (ISC_HIS_ENTRY93) Histogram Entry Offset */
#define ISC_HIS_ENTRY94_REG_OFST       (0x588)             /**< (ISC_HIS_ENTRY94) Histogram Entry Offset */
#define ISC_HIS_ENTRY95_REG_OFST       (0x58C)             /**< (ISC_HIS_ENTRY95) Histogram Entry Offset */
#define ISC_HIS_ENTRY96_REG_OFST       (0x590)             /**< (ISC_HIS_ENTRY96) Histogram Entry Offset */
#define ISC_HIS_ENTRY97_REG_OFST       (0x594)             /**< (ISC_HIS_ENTRY97) Histogram Entry Offset */
#define ISC_HIS_ENTRY98_REG_OFST       (0x598)             /**< (ISC_HIS_ENTRY98) Histogram Entry Offset */
#define ISC_HIS_ENTRY99_REG_OFST       (0x59C)             /**< (ISC_HIS_ENTRY99) Histogram Entry Offset */
#define ISC_HIS_ENTRY100_REG_OFST      (0x5A0)             /**< (ISC_HIS_ENTRY100) Histogram Entry Offset */
#define ISC_HIS_ENTRY101_REG_OFST      (0x5A4)             /**< (ISC_HIS_ENTRY101) Histogram Entry Offset */
#define ISC_HIS_ENTRY102_REG_OFST      (0x5A8)             /**< (ISC_HIS_ENTRY102) Histogram Entry Offset */
#define ISC_HIS_ENTRY103_REG_OFST      (0x5AC)             /**< (ISC_HIS_ENTRY103) Histogram Entry Offset */
#define ISC_HIS_ENTRY104_REG_OFST      (0x5B0)             /**< (ISC_HIS_ENTRY104) Histogram Entry Offset */
#define ISC_HIS_ENTRY105_REG_OFST      (0x5B4)             /**< (ISC_HIS_ENTRY105) Histogram Entry Offset */
#define ISC_HIS_ENTRY106_REG_OFST      (0x5B8)             /**< (ISC_HIS_ENTRY106) Histogram Entry Offset */
#define ISC_HIS_ENTRY107_REG_OFST      (0x5BC)             /**< (ISC_HIS_ENTRY107) Histogram Entry Offset */
#define ISC_HIS_ENTRY108_REG_OFST      (0x5C0)             /**< (ISC_HIS_ENTRY108) Histogram Entry Offset */
#define ISC_HIS_ENTRY109_REG_OFST      (0x5C4)             /**< (ISC_HIS_ENTRY109) Histogram Entry Offset */
#define ISC_HIS_ENTRY110_REG_OFST      (0x5C8)             /**< (ISC_HIS_ENTRY110) Histogram Entry Offset */
#define ISC_HIS_ENTRY111_REG_OFST      (0x5CC)             /**< (ISC_HIS_ENTRY111) Histogram Entry Offset */
#define ISC_HIS_ENTRY112_REG_OFST      (0x5D0)             /**< (ISC_HIS_ENTRY112) Histogram Entry Offset */
#define ISC_HIS_ENTRY113_REG_OFST      (0x5D4)             /**< (ISC_HIS_ENTRY113) Histogram Entry Offset */
#define ISC_HIS_ENTRY114_REG_OFST      (0x5D8)             /**< (ISC_HIS_ENTRY114) Histogram Entry Offset */
#define ISC_HIS_ENTRY115_REG_OFST      (0x5DC)             /**< (ISC_HIS_ENTRY115) Histogram Entry Offset */
#define ISC_HIS_ENTRY116_REG_OFST      (0x5E0)             /**< (ISC_HIS_ENTRY116) Histogram Entry Offset */
#define ISC_HIS_ENTRY117_REG_OFST      (0x5E4)             /**< (ISC_HIS_ENTRY117) Histogram Entry Offset */
#define ISC_HIS_ENTRY118_REG_OFST      (0x5E8)             /**< (ISC_HIS_ENTRY118) Histogram Entry Offset */
