virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27_DFP/component/isc.h
#define ISC_HIS_ENTRY119_REG_OFST      (0x5EC)             /**< (ISC_HIS_ENTRY119) Histogram Entry Offset */
#define ISC_HIS_ENTRY120_REG_OFST      (0x5F0)             /**< (ISC_HIS_ENTRY120) Histogram Entry Offset */
#define ISC_HIS_ENTRY121_REG_OFST      (0x5F4)             /**< (ISC_HIS_ENTRY121) Histogram Entry Offset */
#define ISC_HIS_ENTRY122_REG_OFST      (0x5F8)             /**< (ISC_HIS_ENTRY122) Histogram Entry Offset */
#define ISC_HIS_ENTRY123_REG_OFST      (0x5FC)             /**< (ISC_HIS_ENTRY123) Histogram Entry Offset */
#define ISC_HIS_ENTRY124_REG_OFST      (0x600)             /**< (ISC_HIS_ENTRY124) Histogram Entry Offset */
#define ISC_HIS_ENTRY125_REG_OFST      (0x604)             /**< (ISC_HIS_ENTRY125) Histogram Entry Offset */
#define ISC_HIS_ENTRY126_REG_OFST      (0x608)             /**< (ISC_HIS_ENTRY126) Histogram Entry Offset */
#define ISC_HIS_ENTRY127_REG_OFST      (0x60C)             /**< (ISC_HIS_ENTRY127) Histogram Entry Offset */
#define ISC_HIS_ENTRY128_REG_OFST      (0x610)             /**< (ISC_HIS_ENTRY128) Histogram Entry Offset */
#define ISC_HIS_ENTRY129_REG_OFST      (0x614)             /**< (ISC_HIS_ENTRY129) Histogram Entry Offset */
#define ISC_HIS_ENTRY130_REG_OFST      (0x618)             /**< (ISC_HIS_ENTRY130) Histogram Entry Offset */
#define ISC_HIS_ENTRY131_REG_OFST      (0x61C)             /**< (ISC_HIS_ENTRY131) Histogram Entry Offset */
#define ISC_HIS_ENTRY132_REG_OFST      (0x620)             /**< (ISC_HIS_ENTRY132) Histogram Entry Offset */
#define ISC_HIS_ENTRY133_REG_OFST      (0x624)             /**< (ISC_HIS_ENTRY133) Histogram Entry Offset */
#define ISC_HIS_ENTRY134_REG_OFST      (0x628)             /**< (ISC_HIS_ENTRY134) Histogram Entry Offset */
#define ISC_HIS_ENTRY135_REG_OFST      (0x62C)             /**< (ISC_HIS_ENTRY135) Histogram Entry Offset */
#define ISC_HIS_ENTRY136_REG_OFST      (0x630)             /**< (ISC_HIS_ENTRY136) Histogram Entry Offset */
#define ISC_HIS_ENTRY137_REG_OFST      (0x634)             /**< (ISC_HIS_ENTRY137) Histogram Entry Offset */
#define ISC_HIS_ENTRY138_REG_OFST      (0x638)             /**< (ISC_HIS_ENTRY138) Histogram Entry Offset */
#define ISC_HIS_ENTRY139_REG_OFST      (0x63C)             /**< (ISC_HIS_ENTRY139) Histogram Entry Offset */
#define ISC_HIS_ENTRY140_REG_OFST      (0x640)             /**< (ISC_HIS_ENTRY140) Histogram Entry Offset */
#define ISC_HIS_ENTRY141_REG_OFST      (0x644)             /**< (ISC_HIS_ENTRY141) Histogram Entry Offset */
#define ISC_HIS_ENTRY142_REG_OFST      (0x648)             /**< (ISC_HIS_ENTRY142) Histogram Entry Offset */
#define ISC_HIS_ENTRY143_REG_OFST      (0x64C)             /**< (ISC_HIS_ENTRY143) Histogram Entry Offset */
#define ISC_HIS_ENTRY144_REG_OFST      (0x650)             /**< (ISC_HIS_ENTRY144) Histogram Entry Offset */
#define ISC_HIS_ENTRY145_REG_OFST      (0x654)             /**< (ISC_HIS_ENTRY145) Histogram Entry Offset */
#define ISC_HIS_ENTRY146_REG_OFST      (0x658)             /**< (ISC_HIS_ENTRY146) Histogram Entry Offset */
#define ISC_HIS_ENTRY147_REG_OFST      (0x65C)             /**< (ISC_HIS_ENTRY147) Histogram Entry Offset */
#define ISC_HIS_ENTRY148_REG_OFST      (0x660)             /**< (ISC_HIS_ENTRY148) Histogram Entry Offset */
#define ISC_HIS_ENTRY149_REG_OFST      (0x664)             /**< (ISC_HIS_ENTRY149) Histogram Entry Offset */
#define ISC_HIS_ENTRY150_REG_OFST      (0x668)             /**< (ISC_HIS_ENTRY150) Histogram Entry Offset */
#define ISC_HIS_ENTRY151_REG_OFST      (0x66C)             /**< (ISC_HIS_ENTRY151) Histogram Entry Offset */
#define ISC_HIS_ENTRY152_REG_OFST      (0x670)             /**< (ISC_HIS_ENTRY152) Histogram Entry Offset */
#define ISC_HIS_ENTRY153_REG_OFST      (0x674)             /**< (ISC_HIS_ENTRY153) Histogram Entry Offset */
#define ISC_HIS_ENTRY154_REG_OFST      (0x678)             /**< (ISC_HIS_ENTRY154) Histogram Entry Offset */
#define ISC_HIS_ENTRY155_REG_OFST      (0x67C)             /**< (ISC_HIS_ENTRY155) Histogram Entry Offset */
#define ISC_HIS_ENTRY156_REG_OFST      (0x680)             /**< (ISC_HIS_ENTRY156) Histogram Entry Offset */
#define ISC_HIS_ENTRY157_REG_OFST      (0x684)             /**< (ISC_HIS_ENTRY157) Histogram Entry Offset */
#define ISC_HIS_ENTRY158_REG_OFST      (0x688)             /**< (ISC_HIS_ENTRY158) Histogram Entry Offset */
#define ISC_HIS_ENTRY159_REG_OFST      (0x68C)             /**< (ISC_HIS_ENTRY159) Histogram Entry Offset */
#define ISC_HIS_ENTRY160_REG_OFST      (0x690)             /**< (ISC_HIS_ENTRY160) Histogram Entry Offset */
#define ISC_HIS_ENTRY161_REG_OFST      (0x694)             /**< (ISC_HIS_ENTRY161) Histogram Entry Offset */
#define ISC_HIS_ENTRY162_REG_OFST      (0x698)             /**< (ISC_HIS_ENTRY162) Histogram Entry Offset */
#define ISC_HIS_ENTRY163_REG_OFST      (0x69C)             /**< (ISC_HIS_ENTRY163) Histogram Entry Offset */
#define ISC_HIS_ENTRY164_REG_OFST      (0x6A0)             /**< (ISC_HIS_ENTRY164) Histogram Entry Offset */
#define ISC_HIS_ENTRY165_REG_OFST      (0x6A4)             /**< (ISC_HIS_ENTRY165) Histogram Entry Offset */
#define ISC_HIS_ENTRY166_REG_OFST      (0x6A8)             /**< (ISC_HIS_ENTRY166) Histogram Entry Offset */
#define ISC_HIS_ENTRY167_REG_OFST      (0x6AC)             /**< (ISC_HIS_ENTRY167) Histogram Entry Offset */
#define ISC_HIS_ENTRY168_REG_OFST      (0x6B0)             /**< (ISC_HIS_ENTRY168) Histogram Entry Offset */
#define ISC_HIS_ENTRY169_REG_OFST      (0x6B4)             /**< (ISC_HIS_ENTRY169) Histogram Entry Offset */
#define ISC_HIS_ENTRY170_REG_OFST      (0x6B8)             /**< (ISC_HIS_ENTRY170) Histogram Entry Offset */
#define ISC_HIS_ENTRY171_REG_OFST      (0x6BC)             /**< (ISC_HIS_ENTRY171) Histogram Entry Offset */
#define ISC_HIS_ENTRY172_REG_OFST      (0x6C0)             /**< (ISC_HIS_ENTRY172) Histogram Entry Offset */
#define ISC_HIS_ENTRY173_REG_OFST      (0x6C4)             /**< (ISC_HIS_ENTRY173) Histogram Entry Offset */
#define ISC_HIS_ENTRY174_REG_OFST      (0x6C8)             /**< (ISC_HIS_ENTRY174) Histogram Entry Offset */
#define ISC_HIS_ENTRY175_REG_OFST      (0x6CC)             /**< (ISC_HIS_ENTRY175) Histogram Entry Offset */
#define ISC_HIS_ENTRY176_REG_OFST      (0x6D0)             /**< (ISC_HIS_ENTRY176) Histogram Entry Offset */
#define ISC_HIS_ENTRY177_REG_OFST      (0x6D4)             /**< (ISC_HIS_ENTRY177) Histogram Entry Offset */
#define ISC_HIS_ENTRY178_REG_OFST      (0x6D8)             /**< (ISC_HIS_ENTRY178) Histogram Entry Offset */
#define ISC_HIS_ENTRY179_REG_OFST      (0x6DC)             /**< (ISC_HIS_ENTRY179) Histogram Entry Offset */
#define ISC_HIS_ENTRY180_REG_OFST      (0x6E0)             /**< (ISC_HIS_ENTRY180) Histogram Entry Offset */
#define ISC_HIS_ENTRY181_REG_OFST      (0x6E4)             /**< (ISC_HIS_ENTRY181) Histogram Entry Offset */
#define ISC_HIS_ENTRY182_REG_OFST      (0x6E8)             /**< (ISC_HIS_ENTRY182) Histogram Entry Offset */
#define ISC_HIS_ENTRY183_REG_OFST      (0x6EC)             /**< (ISC_HIS_ENTRY183) Histogram Entry Offset */
#define ISC_HIS_ENTRY184_REG_OFST      (0x6F0)             /**< (ISC_HIS_ENTRY184) Histogram Entry Offset */
#define ISC_HIS_ENTRY185_REG_OFST      (0x6F4)             /**< (ISC_HIS_ENTRY185) Histogram Entry Offset */
#define ISC_HIS_ENTRY186_REG_OFST      (0x6F8)             /**< (ISC_HIS_ENTRY186) Histogram Entry Offset */
#define ISC_HIS_ENTRY187_REG_OFST      (0x6FC)             /**< (ISC_HIS_ENTRY187) Histogram Entry Offset */
#define ISC_HIS_ENTRY188_REG_OFST      (0x700)             /**< (ISC_HIS_ENTRY188) Histogram Entry Offset */
#define ISC_HIS_ENTRY189_REG_OFST      (0x704)             /**< (ISC_HIS_ENTRY189) Histogram Entry Offset */
#define ISC_HIS_ENTRY190_REG_OFST      (0x708)             /**< (ISC_HIS_ENTRY190) Histogram Entry Offset */
#define ISC_HIS_ENTRY191_REG_OFST      (0x70C)             /**< (ISC_HIS_ENTRY191) Histogram Entry Offset */
#define ISC_HIS_ENTRY192_REG_OFST      (0x710)             /**< (ISC_HIS_ENTRY192) Histogram Entry Offset */
#define ISC_HIS_ENTRY193_REG_OFST      (0x714)             /**< (ISC_HIS_ENTRY193) Histogram Entry Offset */
#define ISC_HIS_ENTRY194_REG_OFST      (0x718)             /**< (ISC_HIS_ENTRY194) Histogram Entry Offset */
#define ISC_HIS_ENTRY195_REG_OFST      (0x71C)             /**< (ISC_HIS_ENTRY195) Histogram Entry Offset */
#define ISC_HIS_ENTRY196_REG_OFST      (0x720)             /**< (ISC_HIS_ENTRY196) Histogram Entry Offset */
#define ISC_HIS_ENTRY197_REG_OFST      (0x724)             /**< (ISC_HIS_ENTRY197) Histogram Entry Offset */
#define ISC_HIS_ENTRY198_REG_OFST      (0x728)             /**< (ISC_HIS_ENTRY198) Histogram Entry Offset */
#define ISC_HIS_ENTRY199_REG_OFST      (0x72C)             /**< (ISC_HIS_ENTRY199) Histogram Entry Offset */
#define ISC_HIS_ENTRY200_REG_OFST      (0x730)             /**< (ISC_HIS_ENTRY200) Histogram Entry Offset */
#define ISC_HIS_ENTRY201_REG_OFST      (0x734)             /**< (ISC_HIS_ENTRY201) Histogram Entry Offset */
#define ISC_HIS_ENTRY202_REG_OFST      (0x738)             /**< (ISC_HIS_ENTRY202) Histogram Entry Offset */
#define ISC_HIS_ENTRY203_REG_OFST      (0x73C)             /**< (ISC_HIS_ENTRY203) Histogram Entry Offset */
#define ISC_HIS_ENTRY204_REG_OFST      (0x740)             /**< (ISC_HIS_ENTRY204) Histogram Entry Offset */
#define ISC_HIS_ENTRY205_REG_OFST      (0x744)             /**< (ISC_HIS_ENTRY205) Histogram Entry Offset */
#define ISC_HIS_ENTRY206_REG_OFST      (0x748)             /**< (ISC_HIS_ENTRY206) Histogram Entry Offset */
#define ISC_HIS_ENTRY207_REG_OFST      (0x74C)             /**< (ISC_HIS_ENTRY207) Histogram Entry Offset */
#define ISC_HIS_ENTRY208_REG_OFST      (0x750)             /**< (ISC_HIS_ENTRY208) Histogram Entry Offset */
#define ISC_HIS_ENTRY209_REG_OFST      (0x754)             /**< (ISC_HIS_ENTRY209) Histogram Entry Offset */
#define ISC_HIS_ENTRY210_REG_OFST      (0x758)             /**< (ISC_HIS_ENTRY210) Histogram Entry Offset */
#define ISC_HIS_ENTRY211_REG_OFST      (0x75C)             /**< (ISC_HIS_ENTRY211) Histogram Entry Offset */
#define ISC_HIS_ENTRY212_REG_OFST      (0x760)             /**< (ISC_HIS_ENTRY212) Histogram Entry Offset */
#define ISC_HIS_ENTRY213_REG_OFST      (0x764)             /**< (ISC_HIS_ENTRY213) Histogram Entry Offset */
#define ISC_HIS_ENTRY214_REG_OFST      (0x768)             /**< (ISC_HIS_ENTRY214) Histogram Entry Offset */
#define ISC_HIS_ENTRY215_REG_OFST      (0x76C)             /**< (ISC_HIS_ENTRY215) Histogram Entry Offset */
#define ISC_HIS_ENTRY216_REG_OFST      (0x770)             /**< (ISC_HIS_ENTRY216) Histogram Entry Offset */
#define ISC_HIS_ENTRY217_REG_OFST      (0x774)             /**< (ISC_HIS_ENTRY217) Histogram Entry Offset */
#define ISC_HIS_ENTRY218_REG_OFST      (0x778)             /**< (ISC_HIS_ENTRY218) Histogram Entry Offset */
#define ISC_HIS_ENTRY219_REG_OFST      (0x77C)             /**< (ISC_HIS_ENTRY219) Histogram Entry Offset */
#define ISC_HIS_ENTRY220_REG_OFST      (0x780)             /**< (ISC_HIS_ENTRY220) Histogram Entry Offset */
#define ISC_HIS_ENTRY221_REG_OFST      (0x784)             /**< (ISC_HIS_ENTRY221) Histogram Entry Offset */
#define ISC_HIS_ENTRY222_REG_OFST      (0x788)             /**< (ISC_HIS_ENTRY222) Histogram Entry Offset */
#define ISC_HIS_ENTRY223_REG_OFST      (0x78C)             /**< (ISC_HIS_ENTRY223) Histogram Entry Offset */
#define ISC_HIS_ENTRY224_REG_OFST      (0x790)             /**< (ISC_HIS_ENTRY224) Histogram Entry Offset */
#define ISC_HIS_ENTRY225_REG_OFST      (0x794)             /**< (ISC_HIS_ENTRY225) Histogram Entry Offset */
#define ISC_HIS_ENTRY226_REG_OFST      (0x798)             /**< (ISC_HIS_ENTRY226) Histogram Entry Offset */
#define ISC_HIS_ENTRY227_REG_OFST      (0x79C)             /**< (ISC_HIS_ENTRY227) Histogram Entry Offset */
#define ISC_HIS_ENTRY228_REG_OFST      (0x7A0)             /**< (ISC_HIS_ENTRY228) Histogram Entry Offset */
#define ISC_HIS_ENTRY229_REG_OFST      (0x7A4)             /**< (ISC_HIS_ENTRY229) Histogram Entry Offset */
#define ISC_HIS_ENTRY230_REG_OFST      (0x7A8)             /**< (ISC_HIS_ENTRY230) Histogram Entry Offset */
#define ISC_HIS_ENTRY231_REG_OFST      (0x7AC)             /**< (ISC_HIS_ENTRY231) Histogram Entry Offset */
#define ISC_HIS_ENTRY232_REG_OFST      (0x7B0)             /**< (ISC_HIS_ENTRY232) Histogram Entry Offset */
#define ISC_HIS_ENTRY233_REG_OFST      (0x7B4)             /**< (ISC_HIS_ENTRY233) Histogram Entry Offset */
#define ISC_HIS_ENTRY234_REG_OFST      (0x7B8)             /**< (ISC_HIS_ENTRY234) Histogram Entry Offset */
#define ISC_HIS_ENTRY235_REG_OFST      (0x7BC)             /**< (ISC_HIS_ENTRY235) Histogram Entry Offset */
#define ISC_HIS_ENTRY236_REG_OFST      (0x7C0)             /**< (ISC_HIS_ENTRY236) Histogram Entry Offset */
#define ISC_HIS_ENTRY237_REG_OFST      (0x7C4)             /**< (ISC_HIS_ENTRY237) Histogram Entry Offset */
#define ISC_HIS_ENTRY238_REG_OFST      (0x7C8)             /**< (ISC_HIS_ENTRY238) Histogram Entry Offset */
#define ISC_HIS_ENTRY239_REG_OFST      (0x7CC)             /**< (ISC_HIS_ENTRY239) Histogram Entry Offset */
#define ISC_HIS_ENTRY240_REG_OFST      (0x7D0)             /**< (ISC_HIS_ENTRY240) Histogram Entry Offset */
#define ISC_HIS_ENTRY241_REG_OFST      (0x7D4)             /**< (ISC_HIS_ENTRY241) Histogram Entry Offset */
#define ISC_HIS_ENTRY242_REG_OFST      (0x7D8)             /**< (ISC_HIS_ENTRY242) Histogram Entry Offset */
#define ISC_HIS_ENTRY243_REG_OFST      (0x7DC)             /**< (ISC_HIS_ENTRY243) Histogram Entry Offset */
#define ISC_HIS_ENTRY244_REG_OFST      (0x7E0)             /**< (ISC_HIS_ENTRY244) Histogram Entry Offset */
#define ISC_HIS_ENTRY245_REG_OFST      (0x7E4)             /**< (ISC_HIS_ENTRY245) Histogram Entry Offset */
#define ISC_HIS_ENTRY246_REG_OFST      (0x7E8)             /**< (ISC_HIS_ENTRY246) Histogram Entry Offset */
#define ISC_HIS_ENTRY247_REG_OFST      (0x7EC)             /**< (ISC_HIS_ENTRY247) Histogram Entry Offset */
#define ISC_HIS_ENTRY248_REG_OFST      (0x7F0)             /**< (ISC_HIS_ENTRY248) Histogram Entry Offset */
#define ISC_HIS_ENTRY249_REG_OFST      (0x7F4)             /**< (ISC_HIS_ENTRY249) Histogram Entry Offset */
#define ISC_HIS_ENTRY250_REG_OFST      (0x7F8)             /**< (ISC_HIS_ENTRY250) Histogram Entry Offset */
#define ISC_HIS_ENTRY251_REG_OFST      (0x7FC)             /**< (ISC_HIS_ENTRY251) Histogram Entry Offset */
#define ISC_HIS_ENTRY252_REG_OFST      (0x800)             /**< (ISC_HIS_ENTRY252) Histogram Entry Offset */
#define ISC_HIS_ENTRY253_REG_OFST      (0x804)             /**< (ISC_HIS_ENTRY253) Histogram Entry Offset */
#define ISC_HIS_ENTRY254_REG_OFST      (0x808)             /**< (ISC_HIS_ENTRY254) Histogram Entry Offset */
#define ISC_HIS_ENTRY255_REG_OFST      (0x80C)             /**< (ISC_HIS_ENTRY255) Histogram Entry Offset */
#define ISC_HIS_ENTRY256_REG_OFST      (0x810)             /**< (ISC_HIS_ENTRY256) Histogram Entry Offset */
#define ISC_HIS_ENTRY257_REG_OFST      (0x814)             /**< (ISC_HIS_ENTRY257) Histogram Entry Offset */
#define ISC_HIS_ENTRY258_REG_OFST      (0x818)             /**< (ISC_HIS_ENTRY258) Histogram Entry Offset */
#define ISC_HIS_ENTRY259_REG_OFST      (0x81C)             /**< (ISC_HIS_ENTRY259) Histogram Entry Offset */
#define ISC_HIS_ENTRY260_REG_OFST      (0x820)             /**< (ISC_HIS_ENTRY260) Histogram Entry Offset */
#define ISC_HIS_ENTRY261_REG_OFST      (0x824)             /**< (ISC_HIS_ENTRY261) Histogram Entry Offset */
#define ISC_HIS_ENTRY262_REG_OFST      (0x828)             /**< (ISC_HIS_ENTRY262) Histogram Entry Offset */
#define ISC_HIS_ENTRY263_REG_OFST      (0x82C)             /**< (ISC_HIS_ENTRY263) Histogram Entry Offset */
#define ISC_HIS_ENTRY264_REG_OFST      (0x830)             /**< (ISC_HIS_ENTRY264) Histogram Entry Offset */
#define ISC_HIS_ENTRY265_REG_OFST      (0x834)             /**< (ISC_HIS_ENTRY265) Histogram Entry Offset */
#define ISC_HIS_ENTRY266_REG_OFST      (0x838)             /**< (ISC_HIS_ENTRY266) Histogram Entry Offset */
#define ISC_HIS_ENTRY267_REG_OFST      (0x83C)             /**< (ISC_HIS_ENTRY267) Histogram Entry Offset */
#define ISC_HIS_ENTRY268_REG_OFST      (0x840)             /**< (ISC_HIS_ENTRY268) Histogram Entry Offset */
#define ISC_HIS_ENTRY269_REG_OFST      (0x844)             /**< (ISC_HIS_ENTRY269) Histogram Entry Offset */
#define ISC_HIS_ENTRY270_REG_OFST      (0x848)             /**< (ISC_HIS_ENTRY270) Histogram Entry Offset */
#define ISC_HIS_ENTRY271_REG_OFST      (0x84C)             /**< (ISC_HIS_ENTRY271) Histogram Entry Offset */
#define ISC_HIS_ENTRY272_REG_OFST      (0x850)             /**< (ISC_HIS_ENTRY272) Histogram Entry Offset */
#define ISC_HIS_ENTRY273_REG_OFST      (0x854)             /**< (ISC_HIS_ENTRY273) Histogram Entry Offset */
#define ISC_HIS_ENTRY274_REG_OFST      (0x858)             /**< (ISC_HIS_ENTRY274) Histogram Entry Offset */
#define ISC_HIS_ENTRY275_REG_OFST      (0x85C)             /**< (ISC_HIS_ENTRY275) Histogram Entry Offset */
#define ISC_HIS_ENTRY276_REG_OFST      (0x860)             /**< (ISC_HIS_ENTRY276) Histogram Entry Offset */
#define ISC_HIS_ENTRY277_REG_OFST      (0x864)             /**< (ISC_HIS_ENTRY277) Histogram Entry Offset */
#define ISC_HIS_ENTRY278_REG_OFST      (0x868)             /**< (ISC_HIS_ENTRY278) Histogram Entry Offset */
#define ISC_HIS_ENTRY279_REG_OFST      (0x86C)             /**< (ISC_HIS_ENTRY279) Histogram Entry Offset */
#define ISC_HIS_ENTRY280_REG_OFST      (0x870)             /**< (ISC_HIS_ENTRY280) Histogram Entry Offset */
#define ISC_HIS_ENTRY281_REG_OFST      (0x874)             /**< (ISC_HIS_ENTRY281) Histogram Entry Offset */
#define ISC_HIS_ENTRY282_REG_OFST      (0x878)             /**< (ISC_HIS_ENTRY282) Histogram Entry Offset */
#define ISC_HIS_ENTRY283_REG_OFST      (0x87C)             /**< (ISC_HIS_ENTRY283) Histogram Entry Offset */
#define ISC_HIS_ENTRY284_REG_OFST      (0x880)             /**< (ISC_HIS_ENTRY284) Histogram Entry Offset */
#define ISC_HIS_ENTRY285_REG_OFST      (0x884)             /**< (ISC_HIS_ENTRY285) Histogram Entry Offset */
#define ISC_HIS_ENTRY286_REG_OFST      (0x888)             /**< (ISC_HIS_ENTRY286) Histogram Entry Offset */
#define ISC_HIS_ENTRY287_REG_OFST      (0x88C)             /**< (ISC_HIS_ENTRY287) Histogram Entry Offset */
#define ISC_HIS_ENTRY288_REG_OFST      (0x890)             /**< (ISC_HIS_ENTRY288) Histogram Entry Offset */
#define ISC_HIS_ENTRY289_REG_OFST      (0x894)             /**< (ISC_HIS_ENTRY289) Histogram Entry Offset */
#define ISC_HIS_ENTRY290_REG_OFST      (0x898)             /**< (ISC_HIS_ENTRY290) Histogram Entry Offset */
#define ISC_HIS_ENTRY291_REG_OFST      (0x89C)             /**< (ISC_HIS_ENTRY291) Histogram Entry Offset */
#define ISC_HIS_ENTRY292_REG_OFST      (0x8A0)             /**< (ISC_HIS_ENTRY292) Histogram Entry Offset */
#define ISC_HIS_ENTRY293_REG_OFST      (0x8A4)             /**< (ISC_HIS_ENTRY293) Histogram Entry Offset */
#define ISC_HIS_ENTRY294_REG_OFST      (0x8A8)             /**< (ISC_HIS_ENTRY294) Histogram Entry Offset */
#define ISC_HIS_ENTRY295_REG_OFST      (0x8AC)             /**< (ISC_HIS_ENTRY295) Histogram Entry Offset */
#define ISC_HIS_ENTRY296_REG_OFST      (0x8B0)             /**< (ISC_HIS_ENTRY296) Histogram Entry Offset */
#define ISC_HIS_ENTRY297_REG_OFST      (0x8B4)             /**< (ISC_HIS_ENTRY297) Histogram Entry Offset */
#define ISC_HIS_ENTRY298_REG_OFST      (0x8B8)             /**< (ISC_HIS_ENTRY298) Histogram Entry Offset */
#define ISC_HIS_ENTRY299_REG_OFST      (0x8BC)             /**< (ISC_HIS_ENTRY299) Histogram Entry Offset */
#define ISC_HIS_ENTRY300_REG_OFST      (0x8C0)             /**< (ISC_HIS_ENTRY300) Histogram Entry Offset */
#define ISC_HIS_ENTRY301_REG_OFST      (0x8C4)             /**< (ISC_HIS_ENTRY301) Histogram Entry Offset */
#define ISC_HIS_ENTRY302_REG_OFST      (0x8C8)             /**< (ISC_HIS_ENTRY302) Histogram Entry Offset */
#define ISC_HIS_ENTRY303_REG_OFST      (0x8CC)             /**< (ISC_HIS_ENTRY303) Histogram Entry Offset */
#define ISC_HIS_ENTRY304_REG_OFST      (0x8D0)             /**< (ISC_HIS_ENTRY304) Histogram Entry Offset */
#define ISC_HIS_ENTRY305_REG_OFST      (0x8D4)             /**< (ISC_HIS_ENTRY305) Histogram Entry Offset */
#define ISC_HIS_ENTRY306_REG_OFST      (0x8D8)             /**< (ISC_HIS_ENTRY306) Histogram Entry Offset */
#define ISC_HIS_ENTRY307_REG_OFST      (0x8DC)             /**< (ISC_HIS_ENTRY307) Histogram Entry Offset */
#define ISC_HIS_ENTRY308_REG_OFST      (0x8E0)             /**< (ISC_HIS_ENTRY308) Histogram Entry Offset */
#define ISC_HIS_ENTRY309_REG_OFST      (0x8E4)             /**< (ISC_HIS_ENTRY309) Histogram Entry Offset */
#define ISC_HIS_ENTRY310_REG_OFST      (0x8E8)             /**< (ISC_HIS_ENTRY310) Histogram Entry Offset */
#define ISC_HIS_ENTRY311_REG_OFST      (0x8EC)             /**< (ISC_HIS_ENTRY311) Histogram Entry Offset */
#define ISC_HIS_ENTRY312_REG_OFST      (0x8F0)             /**< (ISC_HIS_ENTRY312) Histogram Entry Offset */
#define ISC_HIS_ENTRY313_REG_OFST      (0x8F4)             /**< (ISC_HIS_ENTRY313) Histogram Entry Offset */
#define ISC_HIS_ENTRY314_REG_OFST      (0x8F8)             /**< (ISC_HIS_ENTRY314) Histogram Entry Offset */
#define ISC_HIS_ENTRY315_REG_OFST      (0x8FC)             /**< (ISC_HIS_ENTRY315) Histogram Entry Offset */
#define ISC_HIS_ENTRY316_REG_OFST      (0x900)             /**< (ISC_HIS_ENTRY316) Histogram Entry Offset */
#define ISC_HIS_ENTRY317_REG_OFST      (0x904)             /**< (ISC_HIS_ENTRY317) Histogram Entry Offset */
#define ISC_HIS_ENTRY318_REG_OFST      (0x908)             /**< (ISC_HIS_ENTRY318) Histogram Entry Offset */
#define ISC_HIS_ENTRY319_REG_OFST      (0x90C)             /**< (ISC_HIS_ENTRY319) Histogram Entry Offset */
#define ISC_HIS_ENTRY320_REG_OFST      (0x910)             /**< (ISC_HIS_ENTRY320) Histogram Entry Offset */
#define ISC_HIS_ENTRY321_REG_OFST      (0x914)             /**< (ISC_HIS_ENTRY321) Histogram Entry Offset */
#define ISC_HIS_ENTRY322_REG_OFST      (0x918)             /**< (ISC_HIS_ENTRY322) Histogram Entry Offset */
#define ISC_HIS_ENTRY323_REG_OFST      (0x91C)             /**< (ISC_HIS_ENTRY323) Histogram Entry Offset */
#define ISC_HIS_ENTRY324_REG_OFST      (0x920)             /**< (ISC_HIS_ENTRY324) Histogram Entry Offset */
#define ISC_HIS_ENTRY325_REG_OFST      (0x924)             /**< (ISC_HIS_ENTRY325) Histogram Entry Offset */
#define ISC_HIS_ENTRY326_REG_OFST      (0x928)             /**< (ISC_HIS_ENTRY326) Histogram Entry Offset */
#define ISC_HIS_ENTRY327_REG_OFST      (0x92C)             /**< (ISC_HIS_ENTRY327) Histogram Entry Offset */
#define ISC_HIS_ENTRY328_REG_OFST      (0x930)             /**< (ISC_HIS_ENTRY328) Histogram Entry Offset */
#define ISC_HIS_ENTRY329_REG_OFST      (0x934)             /**< (ISC_HIS_ENTRY329) Histogram Entry Offset */
#define ISC_HIS_ENTRY330_REG_OFST      (0x938)             /**< (ISC_HIS_ENTRY330) Histogram Entry Offset */
#define ISC_HIS_ENTRY331_REG_OFST      (0x93C)             /**< (ISC_HIS_ENTRY331) Histogram Entry Offset */
#define ISC_HIS_ENTRY332_REG_OFST      (0x940)             /**< (ISC_HIS_ENTRY332) Histogram Entry Offset */
#define ISC_HIS_ENTRY333_REG_OFST      (0x944)             /**< (ISC_HIS_ENTRY333) Histogram Entry Offset */
#define ISC_HIS_ENTRY334_REG_OFST      (0x948)             /**< (ISC_HIS_ENTRY334) Histogram Entry Offset */
#define ISC_HIS_ENTRY335_REG_OFST      (0x94C)             /**< (ISC_HIS_ENTRY335) Histogram Entry Offset */
#define ISC_HIS_ENTRY336_REG_OFST      (0x950)             /**< (ISC_HIS_ENTRY336) Histogram Entry Offset */
#define ISC_HIS_ENTRY337_REG_OFST      (0x954)             /**< (ISC_HIS_ENTRY337) Histogram Entry Offset */
#define ISC_HIS_ENTRY338_REG_OFST      (0x958)             /**< (ISC_HIS_ENTRY338) Histogram Entry Offset */
