virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27_DFP/component/isc.h
#define ISC_HIS_ENTRY339_REG_OFST      (0x95C)             /**< (ISC_HIS_ENTRY339) Histogram Entry Offset */
#define ISC_HIS_ENTRY340_REG_OFST      (0x960)             /**< (ISC_HIS_ENTRY340) Histogram Entry Offset */
#define ISC_HIS_ENTRY341_REG_OFST      (0x964)             /**< (ISC_HIS_ENTRY341) Histogram Entry Offset */
#define ISC_HIS_ENTRY342_REG_OFST      (0x968)             /**< (ISC_HIS_ENTRY342) Histogram Entry Offset */
#define ISC_HIS_ENTRY343_REG_OFST      (0x96C)             /**< (ISC_HIS_ENTRY343) Histogram Entry Offset */
#define ISC_HIS_ENTRY344_REG_OFST      (0x970)             /**< (ISC_HIS_ENTRY344) Histogram Entry Offset */
#define ISC_HIS_ENTRY345_REG_OFST      (0x974)             /**< (ISC_HIS_ENTRY345) Histogram Entry Offset */
#define ISC_HIS_ENTRY346_REG_OFST      (0x978)             /**< (ISC_HIS_ENTRY346) Histogram Entry Offset */
#define ISC_HIS_ENTRY347_REG_OFST      (0x97C)             /**< (ISC_HIS_ENTRY347) Histogram Entry Offset */
#define ISC_HIS_ENTRY348_REG_OFST      (0x980)             /**< (ISC_HIS_ENTRY348) Histogram Entry Offset */
#define ISC_HIS_ENTRY349_REG_OFST      (0x984)             /**< (ISC_HIS_ENTRY349) Histogram Entry Offset */
#define ISC_HIS_ENTRY350_REG_OFST      (0x988)             /**< (ISC_HIS_ENTRY350) Histogram Entry Offset */
#define ISC_HIS_ENTRY351_REG_OFST      (0x98C)             /**< (ISC_HIS_ENTRY351) Histogram Entry Offset */
#define ISC_HIS_ENTRY352_REG_OFST      (0x990)             /**< (ISC_HIS_ENTRY352) Histogram Entry Offset */
#define ISC_HIS_ENTRY353_REG_OFST      (0x994)             /**< (ISC_HIS_ENTRY353) Histogram Entry Offset */
#define ISC_HIS_ENTRY354_REG_OFST      (0x998)             /**< (ISC_HIS_ENTRY354) Histogram Entry Offset */
#define ISC_HIS_ENTRY355_REG_OFST      (0x99C)             /**< (ISC_HIS_ENTRY355) Histogram Entry Offset */
#define ISC_HIS_ENTRY356_REG_OFST      (0x9A0)             /**< (ISC_HIS_ENTRY356) Histogram Entry Offset */
#define ISC_HIS_ENTRY357_REG_OFST      (0x9A4)             /**< (ISC_HIS_ENTRY357) Histogram Entry Offset */
#define ISC_HIS_ENTRY358_REG_OFST      (0x9A8)             /**< (ISC_HIS_ENTRY358) Histogram Entry Offset */
#define ISC_HIS_ENTRY359_REG_OFST      (0x9AC)             /**< (ISC_HIS_ENTRY359) Histogram Entry Offset */
#define ISC_HIS_ENTRY360_REG_OFST      (0x9B0)             /**< (ISC_HIS_ENTRY360) Histogram Entry Offset */
#define ISC_HIS_ENTRY361_REG_OFST      (0x9B4)             /**< (ISC_HIS_ENTRY361) Histogram Entry Offset */
#define ISC_HIS_ENTRY362_REG_OFST      (0x9B8)             /**< (ISC_HIS_ENTRY362) Histogram Entry Offset */
#define ISC_HIS_ENTRY363_REG_OFST      (0x9BC)             /**< (ISC_HIS_ENTRY363) Histogram Entry Offset */
#define ISC_HIS_ENTRY364_REG_OFST      (0x9C0)             /**< (ISC_HIS_ENTRY364) Histogram Entry Offset */
#define ISC_HIS_ENTRY365_REG_OFST      (0x9C4)             /**< (ISC_HIS_ENTRY365) Histogram Entry Offset */
#define ISC_HIS_ENTRY366_REG_OFST      (0x9C8)             /**< (ISC_HIS_ENTRY366) Histogram Entry Offset */
#define ISC_HIS_ENTRY367_REG_OFST      (0x9CC)             /**< (ISC_HIS_ENTRY367) Histogram Entry Offset */
#define ISC_HIS_ENTRY368_REG_OFST      (0x9D0)             /**< (ISC_HIS_ENTRY368) Histogram Entry Offset */
#define ISC_HIS_ENTRY369_REG_OFST      (0x9D4)             /**< (ISC_HIS_ENTRY369) Histogram Entry Offset */
#define ISC_HIS_ENTRY370_REG_OFST      (0x9D8)             /**< (ISC_HIS_ENTRY370) Histogram Entry Offset */
#define ISC_HIS_ENTRY371_REG_OFST      (0x9DC)             /**< (ISC_HIS_ENTRY371) Histogram Entry Offset */
#define ISC_HIS_ENTRY372_REG_OFST      (0x9E0)             /**< (ISC_HIS_ENTRY372) Histogram Entry Offset */
#define ISC_HIS_ENTRY373_REG_OFST      (0x9E4)             /**< (ISC_HIS_ENTRY373) Histogram Entry Offset */
#define ISC_HIS_ENTRY374_REG_OFST      (0x9E8)             /**< (ISC_HIS_ENTRY374) Histogram Entry Offset */
#define ISC_HIS_ENTRY375_REG_OFST      (0x9EC)             /**< (ISC_HIS_ENTRY375) Histogram Entry Offset */
#define ISC_HIS_ENTRY376_REG_OFST      (0x9F0)             /**< (ISC_HIS_ENTRY376) Histogram Entry Offset */
#define ISC_HIS_ENTRY377_REG_OFST      (0x9F4)             /**< (ISC_HIS_ENTRY377) Histogram Entry Offset */
#define ISC_HIS_ENTRY378_REG_OFST      (0x9F8)             /**< (ISC_HIS_ENTRY378) Histogram Entry Offset */
#define ISC_HIS_ENTRY379_REG_OFST      (0x9FC)             /**< (ISC_HIS_ENTRY379) Histogram Entry Offset */
#define ISC_HIS_ENTRY380_REG_OFST      (0xA00)             /**< (ISC_HIS_ENTRY380) Histogram Entry Offset */
#define ISC_HIS_ENTRY381_REG_OFST      (0xA04)             /**< (ISC_HIS_ENTRY381) Histogram Entry Offset */
#define ISC_HIS_ENTRY382_REG_OFST      (0xA08)             /**< (ISC_HIS_ENTRY382) Histogram Entry Offset */
#define ISC_HIS_ENTRY383_REG_OFST      (0xA0C)             /**< (ISC_HIS_ENTRY383) Histogram Entry Offset */
#define ISC_HIS_ENTRY384_REG_OFST      (0xA10)             /**< (ISC_HIS_ENTRY384) Histogram Entry Offset */
#define ISC_HIS_ENTRY385_REG_OFST      (0xA14)             /**< (ISC_HIS_ENTRY385) Histogram Entry Offset */
#define ISC_HIS_ENTRY386_REG_OFST      (0xA18)             /**< (ISC_HIS_ENTRY386) Histogram Entry Offset */
#define ISC_HIS_ENTRY387_REG_OFST      (0xA1C)             /**< (ISC_HIS_ENTRY387) Histogram Entry Offset */
#define ISC_HIS_ENTRY388_REG_OFST      (0xA20)             /**< (ISC_HIS_ENTRY388) Histogram Entry Offset */
#define ISC_HIS_ENTRY389_REG_OFST      (0xA24)             /**< (ISC_HIS_ENTRY389) Histogram Entry Offset */
#define ISC_HIS_ENTRY390_REG_OFST      (0xA28)             /**< (ISC_HIS_ENTRY390) Histogram Entry Offset */
#define ISC_HIS_ENTRY391_REG_OFST      (0xA2C)             /**< (ISC_HIS_ENTRY391) Histogram Entry Offset */
#define ISC_HIS_ENTRY392_REG_OFST      (0xA30)             /**< (ISC_HIS_ENTRY392) Histogram Entry Offset */
#define ISC_HIS_ENTRY393_REG_OFST      (0xA34)             /**< (ISC_HIS_ENTRY393) Histogram Entry Offset */
#define ISC_HIS_ENTRY394_REG_OFST      (0xA38)             /**< (ISC_HIS_ENTRY394) Histogram Entry Offset */
#define ISC_HIS_ENTRY395_REG_OFST      (0xA3C)             /**< (ISC_HIS_ENTRY395) Histogram Entry Offset */
#define ISC_HIS_ENTRY396_REG_OFST      (0xA40)             /**< (ISC_HIS_ENTRY396) Histogram Entry Offset */
#define ISC_HIS_ENTRY397_REG_OFST      (0xA44)             /**< (ISC_HIS_ENTRY397) Histogram Entry Offset */
#define ISC_HIS_ENTRY398_REG_OFST      (0xA48)             /**< (ISC_HIS_ENTRY398) Histogram Entry Offset */
#define ISC_HIS_ENTRY399_REG_OFST      (0xA4C)             /**< (ISC_HIS_ENTRY399) Histogram Entry Offset */
#define ISC_HIS_ENTRY400_REG_OFST      (0xA50)             /**< (ISC_HIS_ENTRY400) Histogram Entry Offset */
#define ISC_HIS_ENTRY401_REG_OFST      (0xA54)             /**< (ISC_HIS_ENTRY401) Histogram Entry Offset */
#define ISC_HIS_ENTRY402_REG_OFST      (0xA58)             /**< (ISC_HIS_ENTRY402) Histogram Entry Offset */
#define ISC_HIS_ENTRY403_REG_OFST      (0xA5C)             /**< (ISC_HIS_ENTRY403) Histogram Entry Offset */
#define ISC_HIS_ENTRY404_REG_OFST      (0xA60)             /**< (ISC_HIS_ENTRY404) Histogram Entry Offset */
#define ISC_HIS_ENTRY405_REG_OFST      (0xA64)             /**< (ISC_HIS_ENTRY405) Histogram Entry Offset */
#define ISC_HIS_ENTRY406_REG_OFST      (0xA68)             /**< (ISC_HIS_ENTRY406) Histogram Entry Offset */
#define ISC_HIS_ENTRY407_REG_OFST      (0xA6C)             /**< (ISC_HIS_ENTRY407) Histogram Entry Offset */
#define ISC_HIS_ENTRY408_REG_OFST      (0xA70)             /**< (ISC_HIS_ENTRY408) Histogram Entry Offset */
#define ISC_HIS_ENTRY409_REG_OFST      (0xA74)             /**< (ISC_HIS_ENTRY409) Histogram Entry Offset */
#define ISC_HIS_ENTRY410_REG_OFST      (0xA78)             /**< (ISC_HIS_ENTRY410) Histogram Entry Offset */
#define ISC_HIS_ENTRY411_REG_OFST      (0xA7C)             /**< (ISC_HIS_ENTRY411) Histogram Entry Offset */
#define ISC_HIS_ENTRY412_REG_OFST      (0xA80)             /**< (ISC_HIS_ENTRY412) Histogram Entry Offset */
#define ISC_HIS_ENTRY413_REG_OFST      (0xA84)             /**< (ISC_HIS_ENTRY413) Histogram Entry Offset */
#define ISC_HIS_ENTRY414_REG_OFST      (0xA88)             /**< (ISC_HIS_ENTRY414) Histogram Entry Offset */
#define ISC_HIS_ENTRY415_REG_OFST      (0xA8C)             /**< (ISC_HIS_ENTRY415) Histogram Entry Offset */
#define ISC_HIS_ENTRY416_REG_OFST      (0xA90)             /**< (ISC_HIS_ENTRY416) Histogram Entry Offset */
#define ISC_HIS_ENTRY417_REG_OFST      (0xA94)             /**< (ISC_HIS_ENTRY417) Histogram Entry Offset */
#define ISC_HIS_ENTRY418_REG_OFST      (0xA98)             /**< (ISC_HIS_ENTRY418) Histogram Entry Offset */
#define ISC_HIS_ENTRY419_REG_OFST      (0xA9C)             /**< (ISC_HIS_ENTRY419) Histogram Entry Offset */
#define ISC_HIS_ENTRY420_REG_OFST      (0xAA0)             /**< (ISC_HIS_ENTRY420) Histogram Entry Offset */
#define ISC_HIS_ENTRY421_REG_OFST      (0xAA4)             /**< (ISC_HIS_ENTRY421) Histogram Entry Offset */
#define ISC_HIS_ENTRY422_REG_OFST      (0xAA8)             /**< (ISC_HIS_ENTRY422) Histogram Entry Offset */
#define ISC_HIS_ENTRY423_REG_OFST      (0xAAC)             /**< (ISC_HIS_ENTRY423) Histogram Entry Offset */
#define ISC_HIS_ENTRY424_REG_OFST      (0xAB0)             /**< (ISC_HIS_ENTRY424) Histogram Entry Offset */
#define ISC_HIS_ENTRY425_REG_OFST      (0xAB4)             /**< (ISC_HIS_ENTRY425) Histogram Entry Offset */
#define ISC_HIS_ENTRY426_REG_OFST      (0xAB8)             /**< (ISC_HIS_ENTRY426) Histogram Entry Offset */
#define ISC_HIS_ENTRY427_REG_OFST      (0xABC)             /**< (ISC_HIS_ENTRY427) Histogram Entry Offset */
#define ISC_HIS_ENTRY428_REG_OFST      (0xAC0)             /**< (ISC_HIS_ENTRY428) Histogram Entry Offset */
#define ISC_HIS_ENTRY429_REG_OFST      (0xAC4)             /**< (ISC_HIS_ENTRY429) Histogram Entry Offset */
#define ISC_HIS_ENTRY430_REG_OFST      (0xAC8)             /**< (ISC_HIS_ENTRY430) Histogram Entry Offset */
#define ISC_HIS_ENTRY431_REG_OFST      (0xACC)             /**< (ISC_HIS_ENTRY431) Histogram Entry Offset */
#define ISC_HIS_ENTRY432_REG_OFST      (0xAD0)             /**< (ISC_HIS_ENTRY432) Histogram Entry Offset */
#define ISC_HIS_ENTRY433_REG_OFST      (0xAD4)             /**< (ISC_HIS_ENTRY433) Histogram Entry Offset */
#define ISC_HIS_ENTRY434_REG_OFST      (0xAD8)             /**< (ISC_HIS_ENTRY434) Histogram Entry Offset */
#define ISC_HIS_ENTRY435_REG_OFST      (0xADC)             /**< (ISC_HIS_ENTRY435) Histogram Entry Offset */
#define ISC_HIS_ENTRY436_REG_OFST      (0xAE0)             /**< (ISC_HIS_ENTRY436) Histogram Entry Offset */
#define ISC_HIS_ENTRY437_REG_OFST      (0xAE4)             /**< (ISC_HIS_ENTRY437) Histogram Entry Offset */
#define ISC_HIS_ENTRY438_REG_OFST      (0xAE8)             /**< (ISC_HIS_ENTRY438) Histogram Entry Offset */
#define ISC_HIS_ENTRY439_REG_OFST      (0xAEC)             /**< (ISC_HIS_ENTRY439) Histogram Entry Offset */
#define ISC_HIS_ENTRY440_REG_OFST      (0xAF0)             /**< (ISC_HIS_ENTRY440) Histogram Entry Offset */
#define ISC_HIS_ENTRY441_REG_OFST      (0xAF4)             /**< (ISC_HIS_ENTRY441) Histogram Entry Offset */
#define ISC_HIS_ENTRY442_REG_OFST      (0xAF8)             /**< (ISC_HIS_ENTRY442) Histogram Entry Offset */
#define ISC_HIS_ENTRY443_REG_OFST      (0xAFC)             /**< (ISC_HIS_ENTRY443) Histogram Entry Offset */
#define ISC_HIS_ENTRY444_REG_OFST      (0xB00)             /**< (ISC_HIS_ENTRY444) Histogram Entry Offset */
#define ISC_HIS_ENTRY445_REG_OFST      (0xB04)             /**< (ISC_HIS_ENTRY445) Histogram Entry Offset */
#define ISC_HIS_ENTRY446_REG_OFST      (0xB08)             /**< (ISC_HIS_ENTRY446) Histogram Entry Offset */
#define ISC_HIS_ENTRY447_REG_OFST      (0xB0C)             /**< (ISC_HIS_ENTRY447) Histogram Entry Offset */
#define ISC_HIS_ENTRY448_REG_OFST      (0xB10)             /**< (ISC_HIS_ENTRY448) Histogram Entry Offset */
#define ISC_HIS_ENTRY449_REG_OFST      (0xB14)             /**< (ISC_HIS_ENTRY449) Histogram Entry Offset */
#define ISC_HIS_ENTRY450_REG_OFST      (0xB18)             /**< (ISC_HIS_ENTRY450) Histogram Entry Offset */
#define ISC_HIS_ENTRY451_REG_OFST      (0xB1C)             /**< (ISC_HIS_ENTRY451) Histogram Entry Offset */
#define ISC_HIS_ENTRY452_REG_OFST      (0xB20)             /**< (ISC_HIS_ENTRY452) Histogram Entry Offset */
#define ISC_HIS_ENTRY453_REG_OFST      (0xB24)             /**< (ISC_HIS_ENTRY453) Histogram Entry Offset */
#define ISC_HIS_ENTRY454_REG_OFST      (0xB28)             /**< (ISC_HIS_ENTRY454) Histogram Entry Offset */
#define ISC_HIS_ENTRY455_REG_OFST      (0xB2C)             /**< (ISC_HIS_ENTRY455) Histogram Entry Offset */
#define ISC_HIS_ENTRY456_REG_OFST      (0xB30)             /**< (ISC_HIS_ENTRY456) Histogram Entry Offset */
#define ISC_HIS_ENTRY457_REG_OFST      (0xB34)             /**< (ISC_HIS_ENTRY457) Histogram Entry Offset */
#define ISC_HIS_ENTRY458_REG_OFST      (0xB38)             /**< (ISC_HIS_ENTRY458) Histogram Entry Offset */
#define ISC_HIS_ENTRY459_REG_OFST      (0xB3C)             /**< (ISC_HIS_ENTRY459) Histogram Entry Offset */
#define ISC_HIS_ENTRY460_REG_OFST      (0xB40)             /**< (ISC_HIS_ENTRY460) Histogram Entry Offset */
#define ISC_HIS_ENTRY461_REG_OFST      (0xB44)             /**< (ISC_HIS_ENTRY461) Histogram Entry Offset */
#define ISC_HIS_ENTRY462_REG_OFST      (0xB48)             /**< (ISC_HIS_ENTRY462) Histogram Entry Offset */
#define ISC_HIS_ENTRY463_REG_OFST      (0xB4C)             /**< (ISC_HIS_ENTRY463) Histogram Entry Offset */
#define ISC_HIS_ENTRY464_REG_OFST      (0xB50)             /**< (ISC_HIS_ENTRY464) Histogram Entry Offset */
#define ISC_HIS_ENTRY465_REG_OFST      (0xB54)             /**< (ISC_HIS_ENTRY465) Histogram Entry Offset */
#define ISC_HIS_ENTRY466_REG_OFST      (0xB58)             /**< (ISC_HIS_ENTRY466) Histogram Entry Offset */
#define ISC_HIS_ENTRY467_REG_OFST      (0xB5C)             /**< (ISC_HIS_ENTRY467) Histogram Entry Offset */
#define ISC_HIS_ENTRY468_REG_OFST      (0xB60)             /**< (ISC_HIS_ENTRY468) Histogram Entry Offset */
#define ISC_HIS_ENTRY469_REG_OFST      (0xB64)             /**< (ISC_HIS_ENTRY469) Histogram Entry Offset */
#define ISC_HIS_ENTRY470_REG_OFST      (0xB68)             /**< (ISC_HIS_ENTRY470) Histogram Entry Offset */
#define ISC_HIS_ENTRY471_REG_OFST      (0xB6C)             /**< (ISC_HIS_ENTRY471) Histogram Entry Offset */
#define ISC_HIS_ENTRY472_REG_OFST      (0xB70)             /**< (ISC_HIS_ENTRY472) Histogram Entry Offset */
#define ISC_HIS_ENTRY473_REG_OFST      (0xB74)             /**< (ISC_HIS_ENTRY473) Histogram Entry Offset */
#define ISC_HIS_ENTRY474_REG_OFST      (0xB78)             /**< (ISC_HIS_ENTRY474) Histogram Entry Offset */
#define ISC_HIS_ENTRY475_REG_OFST      (0xB7C)             /**< (ISC_HIS_ENTRY475) Histogram Entry Offset */
#define ISC_HIS_ENTRY476_REG_OFST      (0xB80)             /**< (ISC_HIS_ENTRY476) Histogram Entry Offset */
#define ISC_HIS_ENTRY477_REG_OFST      (0xB84)             /**< (ISC_HIS_ENTRY477) Histogram Entry Offset */
#define ISC_HIS_ENTRY478_REG_OFST      (0xB88)             /**< (ISC_HIS_ENTRY478) Histogram Entry Offset */
#define ISC_HIS_ENTRY479_REG_OFST      (0xB8C)             /**< (ISC_HIS_ENTRY479) Histogram Entry Offset */
#define ISC_HIS_ENTRY480_REG_OFST      (0xB90)             /**< (ISC_HIS_ENTRY480) Histogram Entry Offset */
#define ISC_HIS_ENTRY481_REG_OFST      (0xB94)             /**< (ISC_HIS_ENTRY481) Histogram Entry Offset */
#define ISC_HIS_ENTRY482_REG_OFST      (0xB98)             /**< (ISC_HIS_ENTRY482) Histogram Entry Offset */
#define ISC_HIS_ENTRY483_REG_OFST      (0xB9C)             /**< (ISC_HIS_ENTRY483) Histogram Entry Offset */
#define ISC_HIS_ENTRY484_REG_OFST      (0xBA0)             /**< (ISC_HIS_ENTRY484) Histogram Entry Offset */
#define ISC_HIS_ENTRY485_REG_OFST      (0xBA4)             /**< (ISC_HIS_ENTRY485) Histogram Entry Offset */
#define ISC_HIS_ENTRY486_REG_OFST      (0xBA8)             /**< (ISC_HIS_ENTRY486) Histogram Entry Offset */
#define ISC_HIS_ENTRY487_REG_OFST      (0xBAC)             /**< (ISC_HIS_ENTRY487) Histogram Entry Offset */
#define ISC_HIS_ENTRY488_REG_OFST      (0xBB0)             /**< (ISC_HIS_ENTRY488) Histogram Entry Offset */
#define ISC_HIS_ENTRY489_REG_OFST      (0xBB4)             /**< (ISC_HIS_ENTRY489) Histogram Entry Offset */
#define ISC_HIS_ENTRY490_REG_OFST      (0xBB8)             /**< (ISC_HIS_ENTRY490) Histogram Entry Offset */
#define ISC_HIS_ENTRY491_REG_OFST      (0xBBC)             /**< (ISC_HIS_ENTRY491) Histogram Entry Offset */
#define ISC_HIS_ENTRY492_REG_OFST      (0xBC0)             /**< (ISC_HIS_ENTRY492) Histogram Entry Offset */
#define ISC_HIS_ENTRY493_REG_OFST      (0xBC4)             /**< (ISC_HIS_ENTRY493) Histogram Entry Offset */
#define ISC_HIS_ENTRY494_REG_OFST      (0xBC8)             /**< (ISC_HIS_ENTRY494) Histogram Entry Offset */
#define ISC_HIS_ENTRY495_REG_OFST      (0xBCC)             /**< (ISC_HIS_ENTRY495) Histogram Entry Offset */
#define ISC_HIS_ENTRY496_REG_OFST      (0xBD0)             /**< (ISC_HIS_ENTRY496) Histogram Entry Offset */
#define ISC_HIS_ENTRY497_REG_OFST      (0xBD4)             /**< (ISC_HIS_ENTRY497) Histogram Entry Offset */
#define ISC_HIS_ENTRY498_REG_OFST      (0xBD8)             /**< (ISC_HIS_ENTRY498) Histogram Entry Offset */
#define ISC_HIS_ENTRY499_REG_OFST      (0xBDC)             /**< (ISC_HIS_ENTRY499) Histogram Entry Offset */
#define ISC_HIS_ENTRY500_REG_OFST      (0xBE0)             /**< (ISC_HIS_ENTRY500) Histogram Entry Offset */
#define ISC_HIS_ENTRY501_REG_OFST      (0xBE4)             /**< (ISC_HIS_ENTRY501) Histogram Entry Offset */
#define ISC_HIS_ENTRY502_REG_OFST      (0xBE8)             /**< (ISC_HIS_ENTRY502) Histogram Entry Offset */
#define ISC_HIS_ENTRY503_REG_OFST      (0xBEC)             /**< (ISC_HIS_ENTRY503) Histogram Entry Offset */
#define ISC_HIS_ENTRY504_REG_OFST      (0xBF0)             /**< (ISC_HIS_ENTRY504) Histogram Entry Offset */
#define ISC_HIS_ENTRY505_REG_OFST      (0xBF4)             /**< (ISC_HIS_ENTRY505) Histogram Entry Offset */
#define ISC_HIS_ENTRY506_REG_OFST      (0xBF8)             /**< (ISC_HIS_ENTRY506) Histogram Entry Offset */
#define ISC_HIS_ENTRY507_REG_OFST      (0xBFC)             /**< (ISC_HIS_ENTRY507) Histogram Entry Offset */
#define ISC_HIS_ENTRY508_REG_OFST      (0xC00)             /**< (ISC_HIS_ENTRY508) Histogram Entry Offset */
#define ISC_HIS_ENTRY509_REG_OFST      (0xC04)             /**< (ISC_HIS_ENTRY509) Histogram Entry Offset */
#define ISC_HIS_ENTRY510_REG_OFST      (0xC08)             /**< (ISC_HIS_ENTRY510) Histogram Entry Offset */
#define ISC_HIS_ENTRY511_REG_OFST      (0xC0C)             /**< (ISC_HIS_ENTRY511) Histogram Entry Offset */

